[Survived] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:15:25
         for (int i = 1; i < n; i++)
             m[i, i] = 0;
 
-        for (int l = 2; l < n; l++)
+        for (int l = 2; l <= n; l++)
         {
             for (int i = 1; i < n - l + 1; i++)

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:17:44
 
         for (int l = 2; l < n; l++)
         {
-            for (int i = 1; i < n - l + 1; i++)
+            for (int i = 1; i < n - l + 1; i--)
             {
                 int j = i + l - 1;
killedBy: Gemini3ProUnitTests.MatrixChainMultiplicationTests.GetOptimalParentheses_WithComplexChain_ReturnsCorrectParenthesisString; Gemini3ProUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_WhenCalledWithValidDimensions_ReturnsMinimumMultiplications; Gemini3ProUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_WhenCalledWithValidDimensions_ReturnsMinimumMultiplications

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:22:45
                 int j = i + l - 1;
                 m[i, j] = int.MaxValue;
 
-                for (int k = i; k <= j - 1; k++)
+                for (int k = i; k <= j - 1; k--)
                 {
                     int q = m[i, k] + m[k + 1, j] + p[i - 1] * p[k] * p[j];
killedBy: Gemini3ProUnitTests.MatrixChainMultiplicationTests.GetOptimalParentheses_WithComplexChain_ReturnsCorrectParenthesisString; Gemini3ProUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_WhenCalledWithValidDimensions_ReturnsMinimumMultiplications; Gemini3ProUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_WhenCalledWithValidDimensions_ReturnsMinimumMultiplications

[Survived] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:25:25
                 for (int k = i; k <= j - 1; k++)
                 {
                     int q = m[i, k] + m[k + 1, j] + p[i - 1] * p[k] * p[j];
-                    if (q < m[i, j])
+                    if (q <= m[i, j])
                     {
                         m[i, j] = q;
