[Killed] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:86:17
         else
         {
             employeeModel.FirstName = employeeModel.FirstName.Trim();
-            if (!wordPattern.IsMatch(employeeModel.FirstName) || employeeModel.FirstName.Length > 50)
+            if (!wordPattern.IsMatch(employeeModel.FirstName) && employeeModel.FirstName.Length > 50)
             {
                 throw new ArgumentException(nameof(employeeModel.FirstName));
killedBy: Gemini3ProUnitTests.EmployeeServiceTests.AddAsync_InvalidFirstName_ThrowsArgumentException; Gemini3ProUnitTests.EmployeeServiceTests.AddAsync_InvalidFirstName_ThrowsArgumentException; Gemini3ProUnitTests.EmployeeServiceTests.AddAsync_FirstNameTooLong_ThrowsArgumentException

[Killed] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:143:17
         else
         {
             employeeModel.City = employeeModel.City.Trim();
-            if (!wordPattern.IsMatch(employeeModel.City) || employeeModel.City.Length > 50)
+            if (!wordPattern.IsMatch(employeeModel.City) && employeeModel.City.Length > 50)
             {
                 throw new ArgumentException(nameof(employeeModel.City));
killedBy: Gemini3ProUnitTests.EmployeeServiceTests.AddAsync_CityTooLong_ThrowsArgumentException
