[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:121:13
             throw new ArgumentNullException(nameof(folderDto));
         }
 
-        if (string.IsNullOrEmpty(folderDto.Name) || folderDto.Name.Contains("/") || folderDto.Name.Length > 255)
+        if (!(string.IsNullOrEmpty(folderDto.Name) || folderDto.Name.Contains("/") || folderDto.Name.Length > 255))
         {
             throw new ArgumentException(nameof(folderDto.Name));
killedBy: Gemini3ProUnitTests.FolderServiceTests.AddFolderAsync_WhenFolderIsValid_AddsToRepositoryAndReturnsId

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:126:13
             throw new ArgumentException(nameof(folderDto.Name));
         }
 
-        if (folderDto.ParentId <= 0)
+        if (!(folderDto.ParentId <= 0))
         {
             throw new ArgumentException(nameof(folderDto.ParentId));
killedBy: Gemini3ProUnitTests.FolderServiceTests.AddFolderAsync_WhenFolderIsValid_AddsToRepositoryAndReturnsId
