[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:29:33
         {
             for (var s = 0; s < numSentences; s++)
             {
-                for (var w = 0; w < numWords; w++)
+                for (var w = 0; w > numWords; w++)
                 {
                     if (w > 0)
killedBy: Gemini3ProUnitTests.LoremIpsumGeneratorTests.GenerateLoremIpsumString_WhenCalledWithValidArgs_ReturnsStringWithCorrectStructure
