[Survived] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:56:33
             for (int j = i + 1; j < n; j++)
             {
                 double sum = 0;
-                for (int k = 0; k < i; k++)
+                for (int k = 0; k <= i; k++)
                     sum += L[j, k] * U[k, i];
 
