[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:28:42
 
             var c = text[i] + key;
             c -= c > letterZ ? 26 * (1 + (c - letterZ - 1) / 26) : 0;
-            c += c < letterA ? 26 * (1 + (letterA - c - 1) / 26) : 0;
+            c += c < letterA ? 26 * (1 + (letterA - c - 1) * 26) : 0;
 
             _ = newText.Append((char)c);
killedBy: Glm45AirUnitTests.CaesarEncoderTests.Encode_PassingAlphabeticTextAndKey_ReturnsEncodedText; Glm45AirUnitTests.CaesarEncoderTests.Decode_PassingAlphabeticTextAndKey_ReturnsDecodedText; Glm45AirUnitTests.CaesarEncoderTests.Decode_PassingAlphabeticTextAndKey_ReturnsDecodedText
