[Killed] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:35:13
         int departmentId,
         int positionId)
     {
-        if (string.IsNullOrEmpty(name) && string.IsNullOrEmpty(country) && string.IsNullOrEmpty(city) &&
-            minSalary <= 0 && maxSalary <= 0 && departmentId <= 0 && positionId <= 0)
+        if (string.IsNullOrEmpty(name) && string.IsNullOrEmpty(country) && string.IsNullOrEmpty(city) &&
+            minSalary <= 0 && maxSalary <= 0 && departmentId <= 0 || positionId <= 0)
         {
             return await ListAsync();
killedBy: Glm45AirUnitTests.EmployeeServiceTests.ListFilteredAsync_WithValidFilters_ReturnsFilteredEmployees
