[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:27:47
 
         for (var p = 0; p < numParagraphs; p++)
         {
-            for (var s = 0; s < numSentences; s++)
+            for (var s = 0; s < numSentences; s--)
             {
                 for (var w = 0; w < numWords; w++)
killedBy: Glm45AirUnitTests.LoremIpsumGeneratorTests.GenerateLoremIpsumString_WithValidParameters_ReturnsString

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:56:47
         for (var p = 0; p < numParagraphs; p++)
         {
             result.Append("<p>");
-            for (var s = 0; s < numSentences; s++)
+            for (var s = 0; s < numSentences; s--)
             {
                 for (var w = 0; w < numWords; w++)
killedBy: Glm45AirUnitTests.LoremIpsumGeneratorTests.GenerateLoremIpsumHtmlSafe_WithValidParameters_ReturnsHtmlString
