[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:11:5
     private readonly IMapper _mapper;
 
     public AuctionService(IUnitOfWork database, IMapper mapper)
-    {
-        _database = database;
-        _mapper = mapper;
-    }
+    {}
 
     public void Bet(int id, string customerName, int bid)
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_ValidBid_UpdatesLeaderAndBidAndSaves; Gpt5MiniUnitTests.AuctionServiceTests.Bet_AuctionNotStarted_ThrowsInvalidAuctionExceptionWithCorrectMessage; Gpt5MiniUnitTests.AuctionServiceTests.OpenAuction_WhenAlreadyStarted_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:18:13
 
     public void Bet(int id, string customerName, int bid)
     {
-        if (id <= 0)
+        if (id > 0)
         {
             throw new InvalidIdException();
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_ValidBid_UpdatesLeaderAndBidAndSaves; Gpt5MiniUnitTests.AuctionServiceTests.Bet_AuctionNotStarted_ThrowsInvalidAuctionExceptionWithCorrectMessage; Gpt5MiniUnitTests.AuctionServiceTests.Bet_InvalidId_ThrowsInvalidIdException

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:18:13
 
     public void Bet(int id, string customerName, int bid)
     {
-        if (id <= 0)
+        if (!(id <= 0))
         {
             throw new InvalidIdException();
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_ValidBid_UpdatesLeaderAndBidAndSaves; Gpt5MiniUnitTests.AuctionServiceTests.Bet_AuctionNotStarted_ThrowsInvalidAuctionExceptionWithCorrectMessage; Gpt5MiniUnitTests.AuctionServiceTests.Bet_InvalidId_ThrowsInvalidIdException

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:20:13
     {
         if (id <= 0)
         {
-            throw new InvalidIdException();
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_InvalidId_ThrowsInvalidIdException; Gpt5MiniUnitTests.AuctionServiceTests.Bet_InvalidId_ThrowsInvalidIdException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:23:13
             throw new InvalidIdException();
         }
 
-        if (customerName == null)
+        if (customerName != null)
         {
             throw new InvalidNameException();
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_ValidBid_UpdatesLeaderAndBidAndSaves; Gpt5MiniUnitTests.AuctionServiceTests.Bet_AuctionNotStarted_ThrowsInvalidAuctionExceptionWithCorrectMessage; Gpt5MiniUnitTests.AuctionServiceTests.Bet_BidNotHigher_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:25:13
 
         if (customerName == null)
         {
-            throw new InvalidNameException();
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_NullCustomerName_ThrowsInvalidNameException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:30:13
 
         var auction = _database.Auctions.Get(id);
 
-        if (auction == null)
+        if (auction != null)
         {
             throw new InvalidIdException();
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_ValidBid_UpdatesLeaderAndBidAndSaves; Gpt5MiniUnitTests.AuctionServiceTests.Bet_AuctionNotStarted_ThrowsInvalidAuctionExceptionWithCorrectMessage; Gpt5MiniUnitTests.AuctionServiceTests.Bet_BidNotHigher_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:35:13
             throw new InvalidIdException();
         }
 
-        if (!auction.Started)
+        if (auction.Started)
         {
             throw new InvalidAuctionException("ERROR: Auction has not started yet");
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_ValidBid_UpdatesLeaderAndBidAndSaves; Gpt5MiniUnitTests.AuctionServiceTests.Bet_AuctionNotStarted_ThrowsInvalidAuctionExceptionWithCorrectMessage; Gpt5MiniUnitTests.AuctionServiceTests.Bet_BidNotHigher_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:37:13
 
         if (!auction.Started)
         {
-            throw new InvalidAuctionException("ERROR: Auction has not started yet");
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_AuctionNotStarted_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:37:47
 
         if (!auction.Started)
         {
-            throw new InvalidAuctionException("ERROR: Auction has not started yet");
+            throw new InvalidAuctionException("");
         }
 
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_AuctionNotStarted_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:40:13
             throw new InvalidAuctionException("ERROR: Auction has not started yet");
         }
 
-        if (auction.Ended)
+        if (!(auction.Ended))
         {
             throw new InvalidAuctionException("ERROR: Auction is over");
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_ValidBid_UpdatesLeaderAndBidAndSaves; Gpt5MiniUnitTests.AuctionServiceTests.Bet_BidNotHigher_ThrowsInvalidAuctionExceptionWithCorrectMessage; Gpt5MiniUnitTests.AuctionServiceTests.Bet_AuctionEnded_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:42:13
 
         if (auction.Ended)
         {
-            throw new InvalidAuctionException("ERROR: Auction is over");
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_AuctionEnded_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:45:13
             throw new InvalidAuctionException("ERROR: Auction is over");
         }
 
-        if (auction.Bid >= bid)
+        if (auction.Bid < bid)
         {
             throw new InvalidAuctionException("ERROR: Invalid bid");
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_ValidBid_UpdatesLeaderAndBidAndSaves; Gpt5MiniUnitTests.AuctionServiceTests.Bet_BidNotHigher_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:45:13
             throw new InvalidAuctionException("ERROR: Auction is over");
         }
 
-        if (auction.Bid >= bid)
+        if (auction.Bid > bid)
         {
             throw new InvalidAuctionException("ERROR: Invalid bid");
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_BidNotHigher_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:47:13
 
         if (auction.Bid >= bid)
         {
-            throw new InvalidAuctionException("ERROR: Invalid bid");
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_BidNotHigher_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:47:47
 
         if (auction.Bid >= bid)
         {
-            throw new InvalidAuctionException("ERROR: Invalid bid");
+            throw new InvalidAuctionException("");
         }
 
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_BidNotHigher_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:53:9
         auction.Bid = bid;
         auction.Leader = customerName;
 
-        _database.Auctions.Update(auction);
+        ;
         _database.Commit();
     }
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_ValidBid_UpdatesLeaderAndBidAndSaves

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:54:9
         auction.Leader = customerName;
 
         _database.Auctions.Update(auction);
-        _database.Commit();
+        ;
     }
 
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.Bet_ValidBid_UpdatesLeaderAndBidAndSaves

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:78:13
 
         if (auction.Ended)
         {
-            throw new InvalidAuctionException("ERROR: Auction has already finished");
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.CloseAuction_AlreadyEnded_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:78:47
 
         if (auction.Ended)
         {
-            throw new InvalidAuctionException("ERROR: Auction has already finished");
+            throw new InvalidAuctionException("");
         }
 
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.CloseAuction_AlreadyEnded_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] Boolean mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:81:25
             throw new InvalidAuctionException("ERROR: Auction has already finished");
         }
 
-        auction.Ended = true;
+        auction.Ended = false;
 
         _database.Auctions.Update(auction);
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.CloseAuction_ValidAuction_SetsEndedAndSaves

[Killed] Null coalescing mutation (remove right)
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:94:23
             throw new InvalidIdException();
         }
 
-        var auction = _mapper.Map<Auction, AuctionDTO>(_database.Auctions.Get(id))
-            ?? throw new InvalidIdException();
+        var auction = _mapper.Map<Auction, AuctionDTO>(_database.Auctions.Get(id));
 
         return auction;
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.GetAuction_MapperReturnsNull_ThrowsInvalidIdException

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:101:5
     }
 
     public IEnumerable<AuctionDTO> GetAuctions()
-    {
-        return _mapper.Map<IEnumerable<Auction>, IEnumerable<AuctionDTO>>(_database.Auctions.GetAll());
-    }
+    {}
 
     public void OpenAuction(int id)
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.GetAuctions_MapsAllAuctions_ReturnsDtos

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:124:13
             throw new InvalidAuctionException("ERROR: Auction has already finished");
         }
 
-        if (auction.Started)
+        if (!(auction.Started))
         {
             throw new InvalidAuctionException("ERROR: Auction has already started");
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.OpenAuction_WhenAlreadyStarted_ThrowsInvalidAuctionExceptionWithCorrectMessage; Gpt5MiniUnitTests.AuctionServiceTests.OpenAuction_ValidAuction_StartsAuctionAndSaves

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:126:13
 
         if (auction.Started)
         {
-            throw new InvalidAuctionException("ERROR: Auction has already started");
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.OpenAuction_WhenAlreadyStarted_ThrowsInvalidAuctionExceptionWithCorrectMessage

[Killed] Boolean mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:129:27
             throw new InvalidAuctionException("ERROR: Auction has already started");
         }
 
-        auction.Started = true;
+        auction.Started = false;
 
         _database.Auctions.Update(auction);
killedBy: Gpt5MiniUnitTests.AuctionServiceTests.OpenAuction_ValidAuction_StartsAuctionAndSaves
