[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:12:25
         int[,] m = new int[n, n];
         s = new int[n, n];
 
-        for (int i = 1; i < n; i++)
+        for (int i = 1; i <= n; i++)
             m[i, i] = 0;
 
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:12:32
         int[,] m = new int[n, n];
         s = new int[n, n];
 
-        for (int i = 1; i < n; i++)
+        for (int i = 1; i < n; i--)
             m[i, i] = 0;
 
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:15:32
         for (int i = 1; i < n; i++)
             m[i, i] = 0;
 
-        for (int l = 2; l < n; l++)
+        for (int l = 2; l < n; l--)
         {
             for (int i = 1; i < n - l + 1; i++)
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:15:25
         for (int i = 1; i < n; i++)
             m[i, i] = 0;
 
-        for (int l = 2; l < n; l++)
+        for (int l = 2; l > n; l++)
         {
             for (int i = 1; i < n - l + 1; i++)
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:17:29
 
         for (int l = 2; l < n; l++)
         {
-            for (int i = 1; i < n - l + 1; i++)
+            for (int i = 1; i > n - l + 1; i++)
             {
                 int j = i + l - 1;
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:17:33
 
         for (int l = 2; l < n; l++)
         {
-            for (int i = 1; i < n - l + 1; i++)
+            for (int i = 1; i < n + l + 1; i++)
             {
                 int j = i + l - 1;
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:19:25
         {
             for (int i = 1; i < n - l + 1; i++)
             {
-                int j = i + l - 1;
+                int j = i + l + 1;
                 m[i, j] = int.MaxValue;
 
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:19:25
         {
             for (int i = 1; i < n - l + 1; i++)
             {
-                int j = i + l - 1;
+                int j = i - l - 1;
                 m[i, j] = int.MaxValue;
 
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:22:38
                 int j = i + l - 1;
                 m[i, j] = int.MaxValue;
 
-                for (int k = i; k <= j - 1; k++)
+                for (int k = i; k <= j + 1; k++)
                 {
                     int q = m[i, k] + m[k + 1, j] + p[i - 1] * p[k] * p[j];
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:22:33
                 int j = i + l - 1;
                 m[i, j] = int.MaxValue;
 
-                for (int k = i; k <= j - 1; k++)
+                for (int k = i; k > j - 1; k++)
                 {
                     int q = m[i, k] + m[k + 1, j] + p[i - 1] * p[k] * p[j];
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:24:53
 
                 for (int k = i; k <= j - 1; k++)
                 {
-                    int q = m[i, k] + m[k + 1, j] + p[i - 1] * p[k] * p[j];
+                    int q = m[i, k] + m[k + 1, j] + p[i - 1] / p[k] * p[j];
                     if (q < m[i, j])
                     {
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:24:41
 
                 for (int k = i; k <= j - 1; k++)
                 {
-                    int q = m[i, k] + m[k + 1, j] + p[i - 1] * p[k] * p[j];
+                    int q = m[i, k] + m[k - 1, j] + p[i - 1] * p[k] * p[j];
                     if (q < m[i, j])
                     {
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:25:25
                 for (int k = i; k <= j - 1; k++)
                 {
                     int q = m[i, k] + m[k + 1, j] + p[i - 1] * p[k] * p[j];
-                    if (q < m[i, j])
+                    if (q > m[i, j])
                     {
                         m[i, j] = q;
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:25:25
                 for (int k = i; k <= j - 1; k++)
                 {
                     int q = m[i, k] + m[k + 1, j] + p[i - 1] * p[k] * p[j];
-                    if (q < m[i, j])
+                    if (!(q < m[i, j]))
                     {
                         m[i, j] = q;
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:26:21
                 {
                     int q = m[i, k] + m[k + 1, j] + p[i - 1] * p[k] * p[j];
                     if (q < m[i, j])
-                    {
-                        m[i, j] = q;
-                        s[i, j] = k;
-                    }
+                    {}
                 }
             }
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:34:21
             }
         }
 
-        return m[1, n - 1];
+        return m[1, n + 1];
     }
 
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:41:13
     {
         StringBuilder result = new StringBuilder();
 
-        if (i == j)
+        if (i != j)
         {
             result.Append($"A{i}");
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:43:13
 
         if (i == j)
         {
-            result.Append($"A{i}");
+            ;
         }
         else
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.GetOptimalParentheses_CustomS_ConstructsExpectedParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:47:13
         }
         else
         {
-            result.Append('(');
+            ;
             result.Append(GetOptimalParentheses(s, i, s[i, j]));
             result.Append(GetOptimalParentheses(s, s[i, j] + 1, j));
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.GetOptimalParentheses_CustomS_ConstructsExpectedParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:48:13
         else
         {
             result.Append('(');
-            result.Append(GetOptimalParentheses(s, i, s[i, j]));
+            ;
             result.Append(GetOptimalParentheses(s, s[i, j] + 1, j));
             result.Append(')');
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.GetOptimalParentheses_CustomS_ConstructsExpectedParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:49:52
         {
             result.Append('(');
             result.Append(GetOptimalParentheses(s, i, s[i, j]));
-            result.Append(GetOptimalParentheses(s, s[i, j] + 1, j));
+            result.Append(GetOptimalParentheses(s, s[i, j] - 1, j));
             result.Append(')');
         }
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.GetOptimalParentheses_CustomS_ConstructsExpectedParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:49:13
         {
             result.Append('(');
             result.Append(GetOptimalParentheses(s, i, s[i, j]));
-            result.Append(GetOptimalParentheses(s, s[i, j] + 1, j));
+            ;
             result.Append(')');
         }
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.GetOptimalParentheses_CustomS_ConstructsExpectedParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample11.cs:50:13
             result.Append('(');
             result.Append(GetOptimalParentheses(s, i, s[i, j]));
             result.Append(GetOptimalParentheses(s, s[i, j] + 1, j));
-            result.Append(')');
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_ClassicExample_ReturnsKnownMinimumAndParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.GetOptimalParentheses_CustomS_ConstructsExpectedParentheses; Gpt5MiniUnitTests.MatrixChainMultiplicationTests.MatrixChainOrder_SimpleTwoMatrices_ReturnsCorrectCostAndS
