[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:21:29
         {
             double max = 0;
             int row = i;
-            for (int k = i; k < n; k++)
+            for (int k = i; k <= n; k++)
             {
                 if (Math.Abs(matrix[k, i]) > max)
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_OneByOneMatrix_ReturnsExpectedLAndUAndP; Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal; Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_SingularMatrix_ThrowsInvalidOperationException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:21:29
         {
             double max = 0;
             int row = i;
-            for (int k = i; k < n; k++)
+            for (int k = i; k > n; k++)
             {
                 if (Math.Abs(matrix[k, i]) > max)
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_OneByOneMatrix_ReturnsExpectedLAndUAndP; Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:23:21
             int row = i;
             for (int k = i; k < n; k++)
             {
-                if (Math.Abs(matrix[k, i]) > max)
+                if (Math.Abs(matrix[k, i]) < max)
                 {
                     max = Math.Abs(matrix[k, i]);
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_OneByOneMatrix_ReturnsExpectedLAndUAndP; Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:23:21
             int row = i;
             for (int k = i; k < n; k++)
             {
-                if (Math.Abs(matrix[k, i]) > max)
+                if (!(Math.Abs(matrix[k, i]) > max))
                 {
                     max = Math.Abs(matrix[k, i]);
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_OneByOneMatrix_ReturnsExpectedLAndUAndP; Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:24:17
             for (int k = i; k < n; k++)
             {
                 if (Math.Abs(matrix[k, i]) > max)
-                {
-                    max = Math.Abs(matrix[k, i]);
-                    row = k;
-                }
+                {}
             }
 
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_OneByOneMatrix_ReturnsExpectedLAndUAndP; Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:30:17
                 }
             }
 
-            if (max == 0)
+            if (max != 0)
                 throw new InvalidOperationException("Матриця є виродженою.");
 
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_OneByOneMatrix_ReturnsExpectedLAndUAndP; Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:31:17
             }
 
             if (max == 0)
-                throw new InvalidOperationException("Матриця є виродженою.");
+                ;
 
             int temp = P[i];
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_SingularMatrix_ThrowsInvalidOperationException

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:31:53
             }
 
             if (max == 0)
-                throw new InvalidOperationException("Матриця є виродженою.");
+                throw new InvalidOperationException("");
 
             int temp = P[i];
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_SingularMatrix_ThrowsInvalidOperationException

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:37:36
             P[i] = P[row];
             P[row] = temp;
 
-            for (int j = 0; j < n; j++)
+            for (int j = 0; j < n; j--)
             {
                 double tmp = matrix[i, j];
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_OneByOneMatrix_ReturnsExpectedLAndUAndP; Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:37:29
             P[i] = P[row];
             P[row] = temp;
 
-            for (int j = 0; j < n; j++)
+            for (int j = 0; j > n; j++)
             {
                 double tmp = matrix[i, j];
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:38:13
             P[row] = temp;
 
             for (int j = 0; j < n; j++)
-            {
-                double tmp = matrix[i, j];
-                matrix[i, j] = matrix[row, j];
-                matrix[row, j] = tmp;
-            }
+            {}
 
             for (int j = i; j < n; j++)
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:44:29
                 matrix[row, j] = tmp;
             }
 
-            for (int j = i; j < n; j++)
+            for (int j = i; j <= n; j++)
             {
                 double sum = 0;
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_OneByOneMatrix_ReturnsExpectedLAndUAndP; Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:44:29
                 matrix[row, j] = tmp;
             }
 
-            for (int j = i; j < n; j++)
+            for (int j = i; j > n; j++)
             {
                 double sum = 0;
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_OneByOneMatrix_ReturnsExpectedLAndUAndP; Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:47:33
             for (int j = i; j < n; j++)
             {
                 double sum = 0;
-                for (int k = 0; k < i; k++)
+                for (int k = 0; k > i; k++)
                     sum += L[i, k] * U[k, j];
 
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:47:40
             for (int j = i; j < n; j++)
             {
                 double sum = 0;
-                for (int k = 0; k < i; k++)
+                for (int k = 0; k < i; k--)
                     sum += L[i, k] * U[k, j];
 
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:48:21
             {
                 double sum = 0;
                 for (int k = 0; k < i; k++)
-                    sum += L[i, k] * U[k, j];
+                    sum -= L[i, k] * U[k, j];
 
                 U[i, j] = matrix[i, j] - sum;
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:48:28
             {
                 double sum = 0;
                 for (int k = 0; k < i; k++)
-                    sum += L[i, k] * U[k, j];
+                    sum += L[i, k] / U[k, j];
 
                 U[i, j] = matrix[i, j] - sum;
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:50:27
                 for (int k = 0; k < i; k++)
                     sum += L[i, k] * U[k, j];
 
-                U[i, j] = matrix[i, j] - sum;
+                U[i, j] = matrix[i, j] + sum;
             }
 
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:53:26
                 U[i, j] = matrix[i, j] - sum;
             }
 
-            for (int j = i + 1; j < n; j++)
+            for (int j = i - 1; j < n; j++)
             {
                 double sum = 0;
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_OneByOneMatrix_ReturnsExpectedLAndUAndP; Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:53:33
                 U[i, j] = matrix[i, j] - sum;
             }
 
-            for (int j = i + 1; j < n; j++)
+            for (int j = i + 1; j > n; j++)
             {
                 double sum = 0;
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:57:21
             {
                 double sum = 0;
                 for (int k = 0; k < i; k++)
-                    sum += L[j, k] * U[k, i];
+                    sum -= L[j, k] * U[k, i];
 
                 L[j, i] = (matrix[j, i] - sum) / U[i, i];
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:57:28
             {
                 double sum = 0;
                 for (int k = 0; k < i; k++)
-                    sum += L[j, k] * U[k, i];
+                    sum += L[j, k] / U[k, i];
 
                 L[j, i] = (matrix[j, i] - sum) / U[i, i];
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:59:28
                 for (int k = 0; k < i; k++)
                     sum += L[j, k] * U[k, i];
 
-                L[j, i] = (matrix[j, i] - sum) / U[i, i];
+                L[j, i] = (matrix[j, i] + sum) / U[i, i];
             }
 
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:59:27
                 for (int k = 0; k < i; k++)
                     sum += L[j, k] * U[k, i];
 
-                L[j, i] = (matrix[j, i] - sum) / U[i, i];
+                L[j, i] = (matrix[j, i] - sum) * U[i, i];
             }
 
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.Decompose_KnownMatrix_ReconstructsPermutedOriginal

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:73:35
         int rows = matrix.GetLength(0);
         int cols = matrix.GetLength(1);
 
-        for (int i = 0; i < rows; i++)
+        for (int i = 0; i < rows; i--)
         {
             for (int j = 0; j < cols; j++)
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.GetMatrix_ReturnsExpectedStringRepresentation

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:75:39
 
         for (int i = 0; i < rows; i++)
         {
-            for (int j = 0; j < cols; j++)
+            for (int j = 0; j < cols; j--)
                 result.Append($"{matrix[i, j]}\t");
             result.Append('\n');
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.GetMatrix_ReturnsExpectedStringRepresentation

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:75:29
 
         for (int i = 0; i < rows; i++)
         {
-            for (int j = 0; j < cols; j++)
+            for (int j = 0; j <= cols; j++)
                 result.Append($"{matrix[i, j]}\t");
             result.Append('\n');
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.GetMatrix_ReturnsExpectedStringRepresentation

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:76:17
         for (int i = 0; i < rows; i++)
         {
             for (int j = 0; j < cols; j++)
-                result.Append($"{matrix[i, j]}\t");
+                ;
             result.Append('\n');
         }
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.GetMatrix_ReturnsExpectedStringRepresentation

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:77:13
         {
             for (int j = 0; j < cols; j++)
                 result.Append($"{matrix[i, j]}\t");
-            result.Append('\n');
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.GetMatrix_ReturnsExpectedStringRepresentation

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:88:25
         StringBuilder result = new StringBuilder();
 
         int n = P.Length;
-        for (int i = 0; i < n; i++)
+        for (int i = 0; i > n; i++)
         {
             for (int j = 0; j < n; j++)
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString; Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:88:25
         StringBuilder result = new StringBuilder();
 
         int n = P.Length;
-        for (int i = 0; i < n; i++)
+        for (int i = 0; i <= n; i++)
         {
             for (int j = 0; j < n; j++)
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString; Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:90:29
         int n = P.Length;
         for (int i = 0; i < n; i++)
         {
-            for (int j = 0; j < n; j++)
+            for (int j = 0; j > n; j++)
                 result.Append(j == P[i] ? "1\t" : "0\t");
             result.Append('\n');
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString; Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:90:29
         int n = P.Length;
         for (int i = 0; i < n; i++)
         {
-            for (int j = 0; j < n; j++)
+            for (int j = 0; j <= n; j++)
                 result.Append(j == P[i] ? "1\t" : "0\t");
             result.Append('\n');
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString; Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString

[Killed] Conditional (false) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:91:31
         for (int i = 0; i < n; i++)
         {
             for (int j = 0; j < n; j++)
-                result.Append(j == P[i] ? "1\t" : "0\t");
+                result.Append((false?"1\t" :"0\t"));
             result.Append('\n');
         }
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString; Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString

[Killed] Conditional (true) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:91:31
         for (int i = 0; i < n; i++)
         {
             for (int j = 0; j < n; j++)
-                result.Append(j == P[i] ? "1\t" : "0\t");
+                result.Append((true?"1\t" :"0\t"));
             result.Append('\n');
         }
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString; Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:92:13
         {
             for (int j = 0; j < n; j++)
                 result.Append(j == P[i] ? "1\t" : "0\t");
-            result.Append('\n');
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString; Gpt5MiniUnitTests.LUPDecompositionTests.GetPermutationMatrix_ReturnsExpectedString
