[Killed] Null coalescing mutation (remove left)
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample13.cs:20:57
 
     private static string ParseUriNode(this INode node)
     {
-        var sparqlResultString = Uri.UnescapeDataString(node.ToString() ?? string.Empty);
+        var sparqlResultString = Uri.UnescapeDataString(string.Empty);
         var separatorIndex = sparqlResultString.IndexOf('#');
         var result = sparqlResultString.Substring(separatorIndex + 1);
killedBy: Gpt5MiniUnitTests.OntologyHelperTests.ParseNode_NodeTypeUri_NoHash_ReturnsFullString; Gpt5MiniUnitTests.OntologyHelperTests.ParseNode_NodeTypeUri_WithHash_ReturnsFragment

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample13.cs:22:51
     {
         var sparqlResultString = Uri.UnescapeDataString(node.ToString() ?? string.Empty);
         var separatorIndex = sparqlResultString.IndexOf('#');
-        var result = sparqlResultString.Substring(separatorIndex + 1);
+        var result = sparqlResultString.Substring(separatorIndex - 1);
 
         return result;
killedBy: Gpt5MiniUnitTests.OntologyHelperTests.ParseNode_NodeTypeUri_HashAtEnd_ReturnsEmptyString; Gpt5MiniUnitTests.OntologyHelperTests.ParseNode_NodeTypeUri_NoHash_ReturnsFullString; Gpt5MiniUnitTests.OntologyHelperTests.ParseNode_NodeTypeUri_WithHash_ReturnsFragment
