[Killed] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:7:13
 {
     public static int[,] GetRhombus(int count)
     {
-        if ((count <= 0) || (count % 2 == 0))
+        if ((count <= 0) && (count % 2 == 0))
         {
             throw new Exception("Error. Invalid input");
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_InvalidCount_ThrowsException; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_InvalidCount_ThrowsException; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_InvalidCount_ThrowsException

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:7:30
 {
     public static int[,] GetRhombus(int count)
     {
-        if ((count <= 0) || (count % 2 == 0))
+        if ((count <= 0) || (count * 2 == 0))
         {
             throw new Exception("Error. Invalid input");
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_InvalidCount_ThrowsException; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_InvalidCount_ThrowsException

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:9:13
     {
         if ((count <= 0) || (count % 2 == 0))
         {
-            throw new Exception("Error. Invalid input");
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_InvalidCount_ThrowsException; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_InvalidCount_ThrowsException; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_InvalidCount_ThrowsException

[Survived] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:24:27
 
     private static int[,] FirstQuarter(int[,] arr)
     {
-        int dividedRows = (int)Math.Sqrt(arr.Length) / 2;
+        int dividedRows = (int)Math.Sqrt(arr.Length) * 2;
         int dividedColumns = (int)Math.Sqrt(arr.Length) / 2;
 

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:25:30
     private static int[,] FirstQuarter(int[,] arr)
     {
         int dividedRows = (int)Math.Sqrt(arr.Length) / 2;
-        int dividedColumns = (int)Math.Sqrt(arr.Length) / 2;
+        int dividedColumns = (int)Math.Sqrt(arr.Length) * 2;
 
         for (int i = 0; i < dividedRows; i++)
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:27:25
         int dividedRows = (int)Math.Sqrt(arr.Length) / 2;
         int dividedColumns = (int)Math.Sqrt(arr.Length) / 2;
 
-        for (int i = 0; i < dividedRows; i++)
+        for (int i = 0; i > dividedRows; i++)
         {
             for (int j = 0; j < dividedColumns; j++)
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:27:42
         int dividedRows = (int)Math.Sqrt(arr.Length) / 2;
         int dividedColumns = (int)Math.Sqrt(arr.Length) / 2;
 
-        for (int i = 0; i < dividedRows; i++)
+        for (int i = 0; i < dividedRows; i--)
         {
             for (int j = 0; j < dividedColumns; j++)
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:29:49
 
         for (int i = 0; i < dividedRows; i++)
         {
-            for (int j = 0; j < dividedColumns; j++)
+            for (int j = 0; j < dividedColumns; j--)
             {
                 arr[i, j] = 1;
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:29:29
 
         for (int i = 0; i < dividedRows; i++)
         {
-            for (int j = 0; j < dividedColumns; j++)
+            for (int j = 0; j <= dividedColumns; j++)
             {
                 arr[i, j] = 1;
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:30:13
         for (int i = 0; i < dividedRows; i++)
         {
             for (int j = 0; j < dividedColumns; j++)
-            {
-                arr[i, j] = 1;
-            }
+            {}
             dividedColumns--;
         }
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:33:13
             {
                 arr[i, j] = 1;
             }
-            dividedColumns--;
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] PostDecrementExpression to PostIncrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:33:13
             {
                 arr[i, j] = 1;
             }
-            dividedColumns--;
+            dividedColumns++;
         }
 
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:43:30
     {
         int dividedRows = (int)Math.Sqrt(arr.Length) / 2;
         int columns = (int)Math.Sqrt(arr.Length);
-        int dividedColumns = columns / 2;
+        int dividedColumns = columns * 2;
 
         for (int i = 0; i < dividedRows; i++)
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:47:39
 
         for (int i = 0; i < dividedRows; i++)
         {
-            for (int j = columns - 1; j > dividedColumns; j--)
+            for (int j = columns - 1; j >= dividedColumns; j--)
             {
                 arr[i, j] = 2;
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] PostDecrementExpression to PostIncrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:47:59
 
         for (int i = 0; i < dividedRows; i++)
         {
-            for (int j = columns - 1; j > dividedColumns; j--)
+            for (int j = columns - 1; j > dividedColumns; j++)
             {
                 arr[i, j] = 2;
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:48:13
         for (int i = 0; i < dividedRows; i++)
         {
             for (int j = columns - 1; j > dividedColumns; j--)
-            {
-                arr[i, j] = 2;
-            }
+            {}
             dividedColumns++;
         }
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:51:13
             {
                 arr[i, j] = 2;
             }
-            dividedColumns++;
+            dividedColumns--;
         }
 
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:51:13
             {
                 arr[i, j] = 2;
             }
-            dividedColumns++;
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:60:30
     private static int[,] ThirdQuarter(int[,] arr)
     {
         int rows = (int)Math.Sqrt(arr.Length);
-        int dividedColumns = (int)Math.Sqrt(arr.Length) / 2;
+        int dividedColumns = (int)Math.Sqrt(arr.Length) * 2;
         int dividedRows = rows / 2;
 
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:61:27
     {
         int rows = (int)Math.Sqrt(arr.Length);
         int dividedColumns = (int)Math.Sqrt(arr.Length) / 2;
-        int dividedRows = rows / 2;
+        int dividedRows = rows * 2;
 
         for (int i = rows - 1; i > dividedRows; i--)
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] PostDecrementExpression to PostIncrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:63:49
         int dividedColumns = (int)Math.Sqrt(arr.Length) / 2;
         int dividedRows = rows / 2;
 
-        for (int i = rows - 1; i > dividedRows; i--)
+        for (int i = rows - 1; i > dividedRows; i++)
         {
             for (int j = 0; j < dividedColumns; j++)
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:63:22
         int dividedColumns = (int)Math.Sqrt(arr.Length) / 2;
         int dividedRows = rows / 2;
 
-        for (int i = rows - 1; i > dividedRows; i--)
+        for (int i = rows + 1; i > dividedRows; i--)
         {
             for (int j = 0; j < dividedColumns; j++)
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:65:29
 
         for (int i = rows - 1; i > dividedRows; i--)
         {
-            for (int j = 0; j < dividedColumns; j++)
+            for (int j = 0; j > dividedColumns; j++)
             {
                 arr[i, j] = 3;
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:66:13
         for (int i = rows - 1; i > dividedRows; i--)
         {
             for (int j = 0; j < dividedColumns; j++)
-            {
-                arr[i, j] = 3;
-            }
+            {}
             dividedColumns--;
         }
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:79:27
     {
         int rows = (int)Math.Sqrt(arr.Length);
         int columns = (int)Math.Sqrt(arr.Length);
-        int dividedRows = rows / 2;
+        int dividedRows = rows * 2;
         int dividedColumns = columns / 2;
 
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:80:30
         int rows = (int)Math.Sqrt(arr.Length);
         int columns = (int)Math.Sqrt(arr.Length);
         int dividedRows = rows / 2;
-        int dividedColumns = columns / 2;
+        int dividedColumns = columns * 2;
 
         for (int i = rows - 1; i > dividedRows; i--)
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:82:32
         int dividedRows = rows / 2;
         int dividedColumns = columns / 2;
 
-        for (int i = rows - 1; i > dividedRows; i--)
+        for (int i = rows - 1; i < dividedRows; i--)
         {
             for (int j = columns - 1; j > dividedColumns; j--)
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:84:26
 
         for (int i = rows - 1; i > dividedRows; i--)
         {
-            for (int j = columns - 1; j > dividedColumns; j--)
+            for (int j = columns + 1; j > dividedColumns; j--)
             {
                 arr[i, j] = 4;
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:85:13
         for (int i = rows - 1; i > dividedRows; i--)
         {
             for (int j = columns - 1; j > dividedColumns; j--)
-            {
-                arr[i, j] = 4;
-            }
+            {}
             dividedColumns++;
         }
killedBy: Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs3_ReturnsExpectedPattern; Gpt5MiniUnitTests.RhombusGeneratorTests.GetRhombus_CountIs5_ReturnsExpectedPattern
