[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample15.cs:9:13
 {
     public static string Encode(this string plainText)
     {
-        if (string.IsNullOrWhiteSpace(plainText))
+        if (!(string.IsNullOrWhiteSpace(plainText)))
             return string.Empty;
 
killedBy: Gpt5MiniUnitTests.Base64HelpersTests.Encode_NullOrWhiteSpace_ReturnsEmpty; Gpt5MiniUnitTests.Base64HelpersTests.Encode_NullOrWhiteSpace_ReturnsEmpty; Gpt5MiniUnitTests.Base64HelpersTests.Encode_NullOrWhiteSpace_ReturnsEmpty

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample15.cs:9:13
 {
     public static string Encode(this string plainText)
     {
-        if (string.IsNullOrWhiteSpace(plainText))
+        if ((plainText!=null))
             return string.Empty;
 
killedBy: Gpt5MiniUnitTests.Base64HelpersTests.Encode_NullOrWhiteSpace_ReturnsEmpty; Gpt5MiniUnitTests.Base64HelpersTests.Encode_AsciiString_ReturnsExpectedBase64; Gpt5MiniUnitTests.Base64HelpersTests.Encode_UnicodeString_ReturnsUtf8Base64

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample15.cs:10:20
     public static string Encode(this string plainText)
     {
         if (string.IsNullOrWhiteSpace(plainText))
-            return string.Empty;
+            return "Stryker was here!";
 
         byte[] plainTextBytes = Encoding.UTF8.GetBytes(plainText);
killedBy: Gpt5MiniUnitTests.Base64HelpersTests.Encode_NullOrWhiteSpace_ReturnsEmpty; Gpt5MiniUnitTests.Base64HelpersTests.Encode_NullOrWhiteSpace_ReturnsEmpty; Gpt5MiniUnitTests.Base64HelpersTests.Encode_NullOrWhiteSpace_ReturnsEmpty

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample15.cs:19:13
 
     public static string Decode(this string base64EncodedData)
     {
-        if (string.IsNullOrWhiteSpace(base64EncodedData))
+        if (!(string.IsNullOrWhiteSpace(base64EncodedData)))
             return string.Empty;
 
killedBy: Gpt5MiniUnitTests.Base64HelpersTests.Decode_NullOrWhiteSpace_ReturnsEmpty; Gpt5MiniUnitTests.Base64HelpersTests.Decode_InvalidBase64_ThrowsFormatException; Gpt5MiniUnitTests.Base64HelpersTests.Decode_InvalidBase64_ThrowsFormatException

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample15.cs:19:13
 
     public static string Decode(this string base64EncodedData)
     {
-        if (string.IsNullOrWhiteSpace(base64EncodedData))
+        if ((base64EncodedData.Trim()!=""))
             return string.Empty;
 
killedBy: Gpt5MiniUnitTests.Base64HelpersTests.Decode_NullOrWhiteSpace_ReturnsEmpty; Gpt5MiniUnitTests.Base64HelpersTests.Decode_InvalidBase64_ThrowsFormatException; Gpt5MiniUnitTests.Base64HelpersTests.Decode_InvalidBase64_ThrowsFormatException

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample15.cs:20:20
     public static string Decode(this string base64EncodedData)
     {
         if (string.IsNullOrWhiteSpace(base64EncodedData))
-            return string.Empty;
+            return "Stryker was here!";
 
         byte[] base64EncodedBytes = Convert.FromBase64String(base64EncodedData);
killedBy: Gpt5MiniUnitTests.Base64HelpersTests.Decode_NullOrWhiteSpace_ReturnsEmpty; Gpt5MiniUnitTests.Base64HelpersTests.Decode_NullOrWhiteSpace_ReturnsEmpty; Gpt5MiniUnitTests.Base64HelpersTests.Decode_NullOrWhiteSpace_ReturnsEmpty
