[Killed] Conditional (false) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample16.cs:11:16
 
     public static string ReplaceNonAsciiCharsWith(this string s, char r)
     {
-        return string.IsNullOrWhiteSpace(s)
-            ? string.Empty
-            : NonAsciiRegex.Replace(s, r.ToString());
+        return (false?string.Empty
+:NonAsciiRegex.Replace(s, r.ToString()));
     }
 
killedBy: Gpt5MiniUnitTests.AsciiHelpersTests.ReplaceNonAsciiCharsWith_NullOrWhitespace_ReturnsEmptyString; Gpt5MiniUnitTests.AsciiHelpersTests.ReplaceNonAsciiCharsWith_NullOrWhitespace_ReturnsEmptyString; Gpt5MiniUnitTests.AsciiHelpersTests.ReplaceNonAsciiCharsWith_NullOrWhitespace_ReturnsEmptyString

[Killed] Conditional (true) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample16.cs:11:16
 
     public static string ReplaceNonAsciiCharsWith(this string s, char r)
     {
-        return string.IsNullOrWhiteSpace(s)
-            ? string.Empty
-            : NonAsciiRegex.Replace(s, r.ToString());
+        return (true?string.Empty
+:NonAsciiRegex.Replace(s, r.ToString()));
     }
 
killedBy: Gpt5MiniUnitTests.AsciiHelpersTests.ReplaceNonAsciiCharsWith_ReplacesVariousNonAsciiPatterns; Gpt5MiniUnitTests.AsciiHelpersTests.ReplaceNonAsciiCharsWith_ReplacesVariousNonAsciiPatterns; Gpt5MiniUnitTests.AsciiHelpersTests.ReplaceNonAsciiCharsWith_AllAscii_ReturnsOriginalString

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample16.cs:12:15
     public static string ReplaceNonAsciiCharsWith(this string s, char r)
     {
         return string.IsNullOrWhiteSpace(s)
-            ? string.Empty
+            ? "Stryker was here!"
             : NonAsciiRegex.Replace(s, r.ToString());
     }
killedBy: Gpt5MiniUnitTests.AsciiHelpersTests.ReplaceNonAsciiCharsWith_NullOrWhitespace_ReturnsEmptyString; Gpt5MiniUnitTests.AsciiHelpersTests.ReplaceNonAsciiCharsWith_NullOrWhitespace_ReturnsEmptyString; Gpt5MiniUnitTests.AsciiHelpersTests.ReplaceNonAsciiCharsWith_NullOrWhitespace_ReturnsEmptyString

[Killed] Conditional (false) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample16.cs:18:16
 
     public static string RemoveNonAsciiChars(this string s)
     {
-        return string.IsNullOrWhiteSpace(s)
-            ? string.Empty
-            : NonAsciiRegex.Replace(s, string.Empty);
+        return (false?string.Empty
+:NonAsciiRegex.Replace(s, string.Empty));
     }
 }
killedBy: Gpt5MiniUnitTests.AsciiHelpersTests.RemoveNonAsciiChars_NullOrWhitespace_ReturnsEmptyString; Gpt5MiniUnitTests.AsciiHelpersTests.RemoveNonAsciiChars_NullOrWhitespace_ReturnsEmptyString; Gpt5MiniUnitTests.AsciiHelpersTests.RemoveNonAsciiChars_NullOrWhitespace_ReturnsEmptyString

[Killed] Conditional (true) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample16.cs:18:16
 
     public static string RemoveNonAsciiChars(this string s)
     {
-        return string.IsNullOrWhiteSpace(s)
-            ? string.Empty
-            : NonAsciiRegex.Replace(s, string.Empty);
+        return (true?string.Empty
+:NonAsciiRegex.Replace(s, string.Empty));
     }
 }
killedBy: Gpt5MiniUnitTests.AsciiHelpersTests.RemoveNonAsciiChars_RemovesNonAsciiCharacters; Gpt5MiniUnitTests.AsciiHelpersTests.RemoveNonAsciiChars_RemovesVariousNonAsciiPatterns; Gpt5MiniUnitTests.AsciiHelpersTests.RemoveNonAsciiChars_RemovesVariousNonAsciiPatterns
