[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:9:25
     {
         var result = new double[vector.Length];
 
-        for (var i = 0; i < vector.Length; i++)
+        for (var i = 0; i <= vector.Length; i++)
         {
             result[i] = vector[i];
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.Copy_EmptyArray_ReturnsEmptyArray; Gpt5MiniUnitTests.VectorExtensionsTests.Copy_WhenCalled_ReturnsNewArrayWithSameElements

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:9:25
     {
         var result = new double[vector.Length];
 
-        for (var i = 0; i < vector.Length; i++)
+        for (var i = 0; i > vector.Length; i++)
         {
             result[i] = vector[i];
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.Copy_WhenCalled_ReturnsNewArrayWithSameElements

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:10:9
         var result = new double[vector.Length];
 
         for (var i = 0; i < vector.Length; i++)
-        {
-            result[i] = vector[i];
-        }
+        {}
 
         return result;
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.Copy_WhenCalled_ReturnsNewArrayWithSameElements

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:21:41
     {
         var result = new double[lhs.Length, rhs.Length];
 
-        for (var i = 0; i < lhs.Length; i++)
+        for (var i = 0; i < lhs.Length; i--)
         {
             for (var j = 0; j < rhs.Length; j++)
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.OuterProduct_WhenCalled_ReturnsCorrectMatrix

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:21:25
     {
         var result = new double[lhs.Length, rhs.Length];
 
-        for (var i = 0; i < lhs.Length; i++)
+        for (var i = 0; i <= lhs.Length; i++)
         {
             for (var j = 0; j < rhs.Length; j++)
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.OuterProduct_WhenCalled_ReturnsCorrectMatrix

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:23:45
 
         for (var i = 0; i < lhs.Length; i++)
         {
-            for (var j = 0; j < rhs.Length; j++)
+            for (var j = 0; j < rhs.Length; j--)
             {
                 result[i, j] = lhs[i] * rhs[j];
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.OuterProduct_WhenCalled_ReturnsCorrectMatrix

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:23:29
 
         for (var i = 0; i < lhs.Length; i++)
         {
-            for (var j = 0; j < rhs.Length; j++)
+            for (var j = 0; j <= rhs.Length; j++)
             {
                 result[i, j] = lhs[i] * rhs[j];
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.OuterProduct_WhenCalled_ReturnsCorrectMatrix; Gpt5MiniUnitTests.VectorExtensionsTests.OuterProduct_WithEmptyRight_ReturnsZeroWidthMatrix

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:25:32
         {
             for (var j = 0; j < rhs.Length; j++)
             {
-                result[i, j] = lhs[i] * rhs[j];
+                result[i, j] = lhs[i] / rhs[j];
             }
         }
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.OuterProduct_WhenCalled_ReturnsCorrectMatrix

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:36:13
     {
         if (lhs.Length != rhs.Length)
         {
-            throw new ArgumentException("Arguments must have same dimension.");
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.Dot_DifferentLengths_ThrowsArgumentException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:41:25
 
         double result = 0;
 
-        for (var i = 0; i < lhs.Length; i++)
+        for (var i = 0; i > lhs.Length; i++)
         {
             result += lhs[i] * rhs[i];
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.Dot_WhenSameLength_ReturnsCorrectResult; Gpt5MiniUnitTests.VectorExtensionsTests.Magnitude_WhenCalled_ReturnsSqrtOfDotProduct

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:50:5
     }
 
     public static double Magnitude(this double[] vector)
-    {
-        return Math.Sqrt(Dot(vector, vector));
-    }
+    {}
 
     public static double[] Scale(this double[] vector, double factor)
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.Magnitude_WhenCalled_ReturnsSqrtOfDotProduct

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:58:44
     {
         var result = new double[vector.Length];
 
-        for (var i = 0; i < vector.Length; i++)
+        for (var i = 0; i < vector.Length; i--)
         {
             result[i] = vector[i] * factor;
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.Scale_WhenCalled_ReturnsScaledArray; Gpt5MiniUnitTests.VectorExtensionsTests.Scale_WhenCalled_ReturnsScaledArray; Gpt5MiniUnitTests.VectorExtensionsTests.Scale_WhenCalled_ReturnsScaledArray

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:60:25
 
         for (var i = 0; i < vector.Length; i++)
         {
-            result[i] = vector[i] * factor;
+            result[i] = vector[i] / factor;
         }
 
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.Scale_WhenCalled_ReturnsScaledArray; Gpt5MiniUnitTests.VectorExtensionsTests.Scale_WhenCalled_ReturnsScaledArray

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:70:25
     {
         var columnVector = new double[source.Length, 1];
 
-        for (var i = 0; i < source.Length; i++)
+        for (var i = 0; i > source.Length; i++)
         {
             columnVector[i, 0] = source[i];
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.ToColumnVector_WhenCalled_ReturnsMatrixWithSingleColumn

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:82:13
     {
         if (source.GetLength(1) != 1)
         {
-            throw new InvalidOperationException("The column vector must have only 1 element in width.");
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.ToRowVector_WhenWidthGreaterThanOne_ThrowsInvalidOperationException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:100:25
         var len = vector.Length;
         var result = new double[len, len];
 
-        for (var i = 0; i < len; i++)
+        for (var i = 0; i <= len; i++)
         {
             result[i, i] = vector[i];
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.ToDiagonalMatrix_EmptyArray_ReturnsZeroByZeroMatrix; Gpt5MiniUnitTests.VectorExtensionsTests.ToDiagonalMatrix_WhenCalled_ReturnsSquareMatrixWithDiagonalSet

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:100:34
         var len = vector.Length;
         var result = new double[len, len];
 
-        for (var i = 0; i < len; i++)
+        for (var i = 0; i < len; i--)
         {
             result[i, i] = vector[i];
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.ToDiagonalMatrix_WhenCalled_ReturnsSquareMatrixWithDiagonalSet

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample17.cs:101:9
         var result = new double[len, len];
 
         for (var i = 0; i < len; i++)
-        {
-            result[i, i] = vector[i];
-        }
+        {}
 
         return result;
killedBy: Gpt5MiniUnitTests.VectorExtensionsTests.ToDiagonalMatrix_WhenCalled_ReturnsSquareMatrixWithDiagonalSet
