[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:9:71
 {
     public static string Encode(string text, int key) => Cipher(text, key);
 
-    public static string Decode(string text, int key) => Cipher(text, -key);
+    public static string Decode(string text, int key) => Cipher(text, +key);
 
     private static string Cipher(string text, int key)
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal; Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal; Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:15:42
     {
         var newText = new StringBuilder(text.Length);
 
-        for (var i = 0; i < text.Length; i++)
+        for (var i = 0; i < text.Length; i--)
         {
             if (!char.IsLetter(text[i]))
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:15:25
     {
         var newText = new StringBuilder(text.Length);
 
-        for (var i = 0; i < text.Length; i++)
+        for (var i = 0; i > text.Length; i++)
         {
             if (!char.IsLetter(text[i]))
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:17:17
 
         for (var i = 0; i < text.Length; i++)
         {
-            if (!char.IsLetter(text[i]))
+            if (char.IsLetter(text[i]))
             {
                 _ = newText.Append(text[i]);
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:20:17
             if (!char.IsLetter(text[i]))
             {
                 _ = newText.Append(text[i]);
-                continue;
+                ;
             }
 
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal; Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal; Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal

[Killed] Conditional (true) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:23:27
                 continue;
             }
 
-            var letterA = char.IsUpper(text[i]) ? 'A' : 'a';
+            var letterA = (true?'A' :'a');
             var letterZ = char.IsUpper(text[i]) ? 'Z' : 'z';
 
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal; Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal

[Killed] Conditional (false) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:23:27
                 continue;
             }
 
-            var letterA = char.IsUpper(text[i]) ? 'A' : 'a';
+            var letterA = (false?'A' :'a');
             var letterZ = char.IsUpper(text[i]) ? 'Z' : 'z';
 
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal; Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal; Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal

[Killed] Conditional (false) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:24:27
             }
 
             var letterA = char.IsUpper(text[i]) ? 'A' : 'a';
-            var letterZ = char.IsUpper(text[i]) ? 'Z' : 'z';
+            var letterZ = (false?'Z' :'z');
 
             var c = text[i] + key;
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal; Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal; Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal

[Survived] Conditional (true) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:24:27
             }
 
             var letterA = char.IsUpper(text[i]) ? 'A' : 'a';
-            var letterZ = char.IsUpper(text[i]) ? 'Z' : 'z';
+            var letterZ = (true?'Z' :'z');
 
             var c = text[i] + key;

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:26:21
             var letterA = char.IsUpper(text[i]) ? 'A' : 'a';
             var letterZ = char.IsUpper(text[i]) ? 'Z' : 'z';
 
-            var c = text[i] + key;
+            var c = text[i] - key;
             c -= c > letterZ ? 26 * (1 + (c - letterZ - 1) / 26) : 0;
             c += c < letterA ? 26 * (1 + (letterA - c - 1) / 26) : 0;
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:27:18
             var letterZ = char.IsUpper(text[i]) ? 'Z' : 'z';
 
             var c = text[i] + key;
-            c -= c > letterZ ? 26 * (1 + (c - letterZ - 1) / 26) : 0;
+            c -= c < letterZ ? 26 * (1 + (c - letterZ - 1) / 26) : 0;
             c += c < letterA ? 26 * (1 + (letterA - c - 1) / 26) : 0;
 
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:27:13
             var letterZ = char.IsUpper(text[i]) ? 'Z' : 'z';
 
             var c = text[i] + key;
-            c -= c > letterZ ? 26 * (1 + (c - letterZ - 1) / 26) : 0;
+            c += c > letterZ ? 26 * (1 + (c - letterZ - 1) / 26) : 0;
             c += c < letterA ? 26 * (1 + (letterA - c - 1) / 26) : 0;
 
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal

[Killed] Conditional (true) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:28:18
 
             var c = text[i] + key;
             c -= c > letterZ ? 26 * (1 + (c - letterZ - 1) / 26) : 0;
-            c += c < letterA ? 26 * (1 + (letterA - c - 1) / 26) : 0;
+            c += (true?26 * (1 + (letterA - c - 1) / 26) :0);
 
             _ = newText.Append((char)c);
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected; Gpt5MiniUnitTests.CaesarEncoderTests.Encode_Lowercase_KeyVariations_ReturnsExpected

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample18.cs:28:32
 
             var c = text[i] + key;
             c -= c > letterZ ? 26 * (1 + (c - letterZ - 1) / 26) : 0;
-            c += c < letterA ? 26 * (1 + (letterA - c - 1) / 26) : 0;
+            c += c < letterA ? 26 / (1 + (letterA - c - 1) / 26) : 0;
 
             _ = newText.Append((char)c);
killedBy: Gpt5MiniUnitTests.CaesarEncoderTests.Decode_WhenApplied_AfterEncode_ReturnsOriginal
