[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:5:60
 
 public static class StringExtensions
 {
-    public static bool IsDigit(this char c) => c >= '0' && c <= '9';
+    public static bool IsDigit(this char c) => c >= '0' && c > '9';
 
     public static bool IsInteger(this string s) => !string.IsNullOrWhiteSpace(s) && int.TryParse(s, out _);
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.IsDigit_CharIsDigit_ReturnsTrue; Gpt5MiniUnitTests.StringExtensionsTests.IsDigit_CharIsDigit_ReturnsTrue; Gpt5MiniUnitTests.StringExtensionsTests.IsDigit_CharIsDigit_ReturnsTrue

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:5:60
 
 public static class StringExtensions
 {
-    public static bool IsDigit(this char c) => c >= '0' && c <= '9';
+    public static bool IsDigit(this char c) => c >= '0' && c < '9';
 
     public static bool IsInteger(this string s) => !string.IsNullOrWhiteSpace(s) && int.TryParse(s, out _);
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.IsDigit_CharIsDigit_ReturnsTrue

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:7:52
 {
     public static bool IsDigit(this char c) => c >= '0' && c <= '9';
 
-    public static bool IsInteger(this string s) => !string.IsNullOrWhiteSpace(s) && int.TryParse(s, out _);
+    public static bool IsInteger(this string s) => string.IsNullOrWhiteSpace(s) && int.TryParse(s, out _);
 
     public static bool IsNumber(this string s) => !string.IsNullOrWhiteSpace(s) && double.TryParse(s, out _);
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.IsInteger_ValidIntegerStrings_ReturnsTrue; Gpt5MiniUnitTests.StringExtensionsTests.IsInteger_ValidIntegerStrings_ReturnsTrue; Gpt5MiniUnitTests.StringExtensionsTests.IsInteger_ValidIntegerStrings_ReturnsTrue

[Killed] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:7:52
 {
     public static bool IsDigit(this char c) => c >= '0' && c <= '9';
 
-    public static bool IsInteger(this string s) => !string.IsNullOrWhiteSpace(s) && int.TryParse(s, out _);
+    public static bool IsInteger(this string s) => !string.IsNullOrWhiteSpace(s) || int.TryParse(s, out _);
 
     public static bool IsNumber(this string s) => !string.IsNullOrWhiteSpace(s) && double.TryParse(s, out _);
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.IsInteger_InvalidIntegerStrings_ReturnsFalse; Gpt5MiniUnitTests.StringExtensionsTests.IsInteger_InvalidIntegerStrings_ReturnsFalse; Gpt5MiniUnitTests.StringExtensionsTests.IsInteger_InvalidIntegerStrings_ReturnsFalse

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:9:51
 
     public static bool IsInteger(this string s) => !string.IsNullOrWhiteSpace(s) && int.TryParse(s, out _);
 
-    public static bool IsNumber(this string s) => !string.IsNullOrWhiteSpace(s) && double.TryParse(s, out _);
+    public static bool IsNumber(this string s) => string.IsNullOrWhiteSpace(s) && double.TryParse(s, out _);
 
     public static string Reverse(this string s)
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.IsNumber_ValidNumberStrings_ReturnsTrue; Gpt5MiniUnitTests.StringExtensionsTests.IsNumber_ValidNumberStrings_ReturnsTrue; Gpt5MiniUnitTests.StringExtensionsTests.IsNumber_ValidNumberStrings_ReturnsTrue

[Killed] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:9:51
 
     public static bool IsInteger(this string s) => !string.IsNullOrWhiteSpace(s) && int.TryParse(s, out _);
 
-    public static bool IsNumber(this string s) => !string.IsNullOrWhiteSpace(s) && double.TryParse(s, out _);
+    public static bool IsNumber(this string s) => !string.IsNullOrWhiteSpace(s) || double.TryParse(s, out _);
 
     public static string Reverse(this string s)
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.IsNumber_InvalidNumberStrings_ReturnsFalse

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:13:13
 
     public static string Reverse(this string s)
     {
-        if (string.IsNullOrWhiteSpace(s))
+        if (!(string.IsNullOrWhiteSpace(s)))
             return s;
 
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.Reverse_NullOrEmptyOrWhitespace_ReturnsSame; Gpt5MiniUnitTests.StringExtensionsTests.Reverse_NormalString_ReturnsReversed

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:13:13
 
     public static string Reverse(this string s)
     {
-        if (string.IsNullOrWhiteSpace(s))
+        if ((s.Trim()!=""))
             return s;
 
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.Reverse_NullOrEmptyOrWhitespace_ReturnsSame; Gpt5MiniUnitTests.StringExtensionsTests.Reverse_NormalString_ReturnsReversed

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:17:9
             return s;
 
         var chars = s.ToCharArray();
-        Array.Reverse(chars);
+        ;
 
         return new string(chars);
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.Reverse_NormalString_ReturnsReversed

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:24:13
 
     public static string ToCsvCompatible(this string s)
     {
-        if (string.IsNullOrEmpty(s))
+        if (!(string.IsNullOrEmpty(s)))
             return s;
 
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_ContainsSemicolon_WrapsWithQuotes; Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_ContainsNewline_WrapsWithQuotes; Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_TrailingSpace_WrapsWithQuotes

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:27:13
         if (string.IsNullOrEmpty(s))
             return s;
 
-        if (s.Contains('"'))
+        if (!(s.Contains('"')))
             s = s.Replace("\"", "\"\"");
 
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_ContainsQuote_ReplacesAndWraps

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:28:33
             return s;
 
         if (s.Contains('"'))
-            s = s.Replace("\"", "\"\"");
+            s = s.Replace("\"", "");
 
         if (s.Contains(',') ||
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_ContainsQuote_ReplacesAndWraps

[Killed] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:30:13
         if (s.Contains('"'))
             s = s.Replace("\"", "\"\"");
 
-        if (s.Contains(',') ||
-            s.Contains(';') ||
-            s.Contains('"') ||
-            s.Contains('\n') ||
+        if (s.Contains(',') ||
+            s.Contains(';') ||
+            s.Contains('"') &&
+            s.Contains('\n') ||
             s[0] == ' ' ||
             s[s.Length - 1] == ' ')
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_ContainsSemicolon_WrapsWithQuotes; Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_ContainsNewline_WrapsWithQuotes; Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_ContainsQuote_ReplacesAndWraps

[Killed] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:30:13
         if (s.Contains('"'))
             s = s.Replace("\"", "\"\"");
 
-        if (s.Contains(',') ||
-            s.Contains(';') ||
-            s.Contains('"') ||
+        if (s.Contains(',') ||
+            s.Contains(';') &&
+            s.Contains('"') ||
             s.Contains('\n') ||
             s[0] == ' ' ||
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_ContainsSemicolon_WrapsWithQuotes; Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_ContainsQuote_ReplacesAndWraps; Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_ContainsComma_WrapsWithQuotes

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:34:13
             s.Contains(';') ||
             s.Contains('"') ||
             s.Contains('\n') ||
-            s[0] == ' ' ||
+            s[0] != ' ' ||
             s[s.Length - 1] == ' ')
         {
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_NoSpecialCharacters_ReturnsSameString; Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_LeadingSpace_WrapsWithQuotes

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:35:13
             s.Contains('"') ||
             s.Contains('\n') ||
             s[0] == ' ' ||
-            s[s.Length - 1] == ' ')
+            s[s.Length - 1] != ' ')
         {
             s = $"\"{s}\"";
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_TrailingSpace_WrapsWithQuotes; Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_NoSpecialCharacters_ReturnsSameString

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:35:15
             s.Contains('"') ||
             s.Contains('\n') ||
             s[0] == ' ' ||
-            s[s.Length - 1] == ' ')
+            s[s.Length + 1] == ' ')
         {
             s = $"\"{s}\"";
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_TrailingSpace_WrapsWithQuotes; Gpt5MiniUnitTests.StringExtensionsTests.ToCsvCompatible_NoSpecialCharacters_ReturnsSameString

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:45:13
 
     public static string GetFileExtension(this string s)
     {
-        if (string.IsNullOrWhiteSpace(s))
+        if ((s!=null))
             return s;
 
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.GetFileExtension_NullOrWhitespace_ReturnsSame; Gpt5MiniUnitTests.StringExtensionsTests.GetFileExtension_MultipleDots_ReturnsAfterLastDot; Gpt5MiniUnitTests.StringExtensionsTests.GetFileExtension_TrailingDot_ReturnsEmptyString

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:50:16
 
         var pos = s.LastIndexOf('.');
 
-        return pos < 0
+        return pos <= 0
             ? string.Empty
             : s.Substring(pos + 1).Trim();
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.GetFileExtension_LeadingDot_ReturnsExtension

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:50:16
 
         var pos = s.LastIndexOf('.');
 
-        return pos < 0
+        return pos > 0
             ? string.Empty
             : s.Substring(pos + 1).Trim();
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.GetFileExtension_MultipleDots_ReturnsAfterLastDot; Gpt5MiniUnitTests.StringExtensionsTests.GetFileExtension_NoDot_ReturnsEmptyString; Gpt5MiniUnitTests.StringExtensionsTests.GetFileExtension_ExtensionWithSpaces_IsTrimmed

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:52:27
 
         return pos < 0
             ? string.Empty
-            : s.Substring(pos + 1).Trim();
+            : s.Substring(pos - 1).Trim();
     }
 }
killedBy: Gpt5MiniUnitTests.StringExtensionsTests.GetFileExtension_MultipleDots_ReturnsAfterLastDot; Gpt5MiniUnitTests.StringExtensionsTests.GetFileExtension_TrailingDot_ReturnsEmptyString; Gpt5MiniUnitTests.StringExtensionsTests.GetFileExtension_ExtensionWithSpaces_IsTrimmed
