[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:10:5
     private readonly IEmployeeRepository _employeeRepository;
 
     public EmployeeService(IEmployeeRepository employeeRepository)
-    {
-        _employeeRepository = employeeRepository;
-    }
+    {}
 
     public async Task<EmployeeModel> GetAsync(int id)
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.DeleteAsync_ForwardsToRepositoryAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.GetAsync_WhenEntityExists_ReturnsMappedModel; Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:15:5
     }
 
     public async Task<EmployeeModel> GetAsync(int id)
-    {
-        var result = await _employeeRepository.GetAsync(id);
-        return MapEntityToModel(result);
-    }
+    {}
 
     public async Task<ICollection<EmployeeModel>> ListAsync()
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.GetAsync_WhenEntityExists_ReturnsMappedModel

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:21:5
     }
 
     public async Task<ICollection<EmployeeModel>> ListAsync()
-    {
-        var result = await _employeeRepository.ListAsync();
-        return result.Select(e => MapEntityToModel(e)).ToList();
-    }
+    {}
 
     public async Task<ICollection<EmployeeModel>> ListFilteredAsync(
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.ListFilteredAsync_NoFilters_CallsListAsync; Gpt5MiniUnitTests.EmployeeServiceTests.ListAsync_WhenCalled_ReturnsMappedModels

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:35:13
         int departmentId,
         int positionId)
     {
-        if (string.IsNullOrEmpty(name) && string.IsNullOrEmpty(country) && string.IsNullOrEmpty(city) &&
-            minSalary <= 0 && maxSalary <= 0 && departmentId <= 0 && positionId <= 0)
+        if (!(string.IsNullOrEmpty(name) && string.IsNullOrEmpty(country) && string.IsNullOrEmpty(city) &&
+            minSalary <= 0 && maxSalary <= 0 && departmentId <= 0 && positionId <= 0))
         {
             return await ListAsync();
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.ListFilteredAsync_NoFilters_CallsListAsync; Gpt5MiniUnitTests.EmployeeServiceTests.ListFilteredAsync_WithFilters_CallsRepositoryFiltered

[Survived] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:35:13
         int departmentId,
         int positionId)
     {
-        if (string.IsNullOrEmpty(name) && string.IsNullOrEmpty(country) && string.IsNullOrEmpty(city) &&
-            minSalary <= 0 && maxSalary <= 0 && departmentId <= 0 && positionId <= 0)
+        if (string.IsNullOrEmpty(name) && string.IsNullOrEmpty(country) && string.IsNullOrEmpty(city) ||
+            minSalary <= 0 && maxSalary <= 0 && departmentId <= 0 && positionId <= 0)
         {
             return await ListAsync();

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:36:49
         int positionId)
     {
         if (string.IsNullOrEmpty(name) && string.IsNullOrEmpty(country) && string.IsNullOrEmpty(city) &&
-            minSalary <= 0 && maxSalary <= 0 && departmentId <= 0 && positionId <= 0)
+            minSalary <= 0 && maxSalary <= 0 && departmentId < 0 && positionId <= 0)
         {
             return await ListAsync();
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.ListFilteredAsync_NoFilters_CallsListAsync

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:36:31
         int positionId)
     {
         if (string.IsNullOrEmpty(name) && string.IsNullOrEmpty(country) && string.IsNullOrEmpty(city) &&
-            minSalary <= 0 && maxSalary <= 0 && departmentId <= 0 && positionId <= 0)
+            minSalary <= 0 && maxSalary < 0 && departmentId <= 0 && positionId <= 0)
         {
             return await ListAsync();
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.ListFilteredAsync_NoFilters_CallsListAsync

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:37:9
     {
         if (string.IsNullOrEmpty(name) && string.IsNullOrEmpty(country) && string.IsNullOrEmpty(city) &&
             minSalary <= 0 && maxSalary <= 0 && departmentId <= 0 && positionId <= 0)
-        {
-            return await ListAsync();
-        }
+        {}
 
         var result = await _employeeRepository.ListFilteredAsync(
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.ListFilteredAsync_NoFilters_CallsListAsync

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:48:9
 
     public async Task<int> AddAsync(EmployeeModel employeeModel)
     {
-        ValidateEmployee(employeeModel);
+        ;
         return await _employeeRepository.AddAsync(MapModelToEntity(employeeModel));
     }
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_NullModel_ThrowsArgumentNullException; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:56:13
     {
         ValidateEmployee(employeeModel);
 
-        if (employeeModel.Id <= 0)
+        if (employeeModel.Id > 0)
         {
             throw new ArgumentException(nameof(employeeModel.Id));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:56:13
     {
         ValidateEmployee(employeeModel);
 
-        if (employeeModel.Id <= 0)
+        if (!(employeeModel.Id <= 0))
         {
             throw new ArgumentException(nameof(employeeModel.Id));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult

[Survived] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:58:13
 
         if (employeeModel.Id <= 0)
         {
-            throw new ArgumentException(nameof(employeeModel.Id));
+            ;
         }
 

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:65:5
     }
 
     public async Task<int> DeleteAsync(int id)
-    {
-        return await _employeeRepository.DeleteAsync(id);
-    }
+    {}
 
     private static void ValidateEmployee(EmployeeModel employeeModel)
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.DeleteAsync_ForwardsToRepositoryAndReturnsResult

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:71:13
 
     private static void ValidateEmployee(EmployeeModel employeeModel)
     {
-        if (employeeModel == null)
+        if (employeeModel != null)
         {
             throw new ArgumentNullException(nameof(employeeModel));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_NullModel_ThrowsArgumentNullException; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_NullModel_ThrowsArgumentNullException

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:73:13
     {
         if (employeeModel == null)
         {
-            throw new ArgumentNullException(nameof(employeeModel));
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_NullModel_ThrowsArgumentNullException; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_NullModel_ThrowsArgumentNullException

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:79:13
         Regex wordPattern = new Regex("^[a-zA-Z- ]+$");
         Regex phonePattern = new Regex("^[+][0-9]{10,12}$");
 
-        if (string.IsNullOrWhiteSpace(employeeModel.FirstName))
+        if (!(string.IsNullOrWhiteSpace(employeeModel.FirstName)))
         {
             throw new ArgumentException(nameof(employeeModel.FirstName));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:79:13
         Regex wordPattern = new Regex("^[a-zA-Z- ]+$");
         Regex phonePattern = new Regex("^[+][0-9]{10,12}$");
 
-        if (string.IsNullOrWhiteSpace(employeeModel.FirstName))
+        if ((employeeModel.FirstName!=""))
         {
             throw new ArgumentException(nameof(employeeModel.FirstName));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Survived] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:81:13
 
         if (string.IsNullOrWhiteSpace(employeeModel.FirstName))
         {
-            throw new ArgumentException(nameof(employeeModel.FirstName));
+            ;
         }
         else

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:86:17
         else
         {
             employeeModel.FirstName = employeeModel.FirstName.Trim();
-            if (!wordPattern.IsMatch(employeeModel.FirstName) || employeeModel.FirstName.Length > 50)
+            if (!(!wordPattern.IsMatch(employeeModel.FirstName) || employeeModel.FirstName.Length > 50))
             {
                 throw new ArgumentException(nameof(employeeModel.FirstName));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:86:66
         else
         {
             employeeModel.FirstName = employeeModel.FirstName.Trim();
-            if (!wordPattern.IsMatch(employeeModel.FirstName) || employeeModel.FirstName.Length > 50)
+            if (!wordPattern.IsMatch(employeeModel.FirstName) || employeeModel.FirstName.Length < 50)
             {
                 throw new ArgumentException(nameof(employeeModel.FirstName));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:92:13
             }
         }
 
-        if (string.IsNullOrWhiteSpace(employeeModel.LastName))
+        if (!(string.IsNullOrWhiteSpace(employeeModel.LastName)))
         {
             throw new ArgumentException(nameof(employeeModel.LastName));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:92:13
             }
         }
 
-        if (string.IsNullOrWhiteSpace(employeeModel.LastName))
+        if ((employeeModel.LastName!=""))
         {
             throw new ArgumentException(nameof(employeeModel.LastName));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[NoCoverage] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:94:13
 
         if (string.IsNullOrWhiteSpace(employeeModel.LastName))
         {
-            throw new ArgumentException(nameof(employeeModel.LastName));
+            ;
         }
         else

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:99:17
         else
         {
             employeeModel.LastName = employeeModel.LastName.Trim();
-            if (!wordPattern.IsMatch(employeeModel.LastName) || employeeModel.LastName.Length > 50)
+            if (wordPattern.IsMatch(employeeModel.LastName) || employeeModel.LastName.Length > 50)
             {
                 throw new ArgumentException(nameof(employeeModel.LastName));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:99:65
         else
         {
             employeeModel.LastName = employeeModel.LastName.Trim();
-            if (!wordPattern.IsMatch(employeeModel.LastName) || employeeModel.LastName.Length > 50)
+            if (!wordPattern.IsMatch(employeeModel.LastName) || employeeModel.LastName.Length < 50)
             {
                 throw new ArgumentException(nameof(employeeModel.LastName));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:105:13
             }
         }
 
-        if (string.IsNullOrWhiteSpace(employeeModel.MiddleName))
+        if (!(string.IsNullOrWhiteSpace(employeeModel.MiddleName)))
         {
             throw new ArgumentException(nameof(employeeModel.MiddleName));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:105:13
             }
         }
 
-        if (string.IsNullOrWhiteSpace(employeeModel.MiddleName))
+        if ((employeeModel.MiddleName.Trim()!=""))
         {
             throw new ArgumentException(nameof(employeeModel.MiddleName));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[NoCoverage] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:107:13
 
         if (string.IsNullOrWhiteSpace(employeeModel.MiddleName))
         {
-            throw new ArgumentException(nameof(employeeModel.MiddleName));
+            ;
         }
         else

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:112:17
         else
         {
             employeeModel.MiddleName = employeeModel.MiddleName.Trim();
-            if (!wordPattern.IsMatch(employeeModel.MiddleName) || employeeModel.MiddleName.Length > 50)
+            if (wordPattern.IsMatch(employeeModel.MiddleName) || employeeModel.MiddleName.Length > 50)
             {
                 throw new ArgumentException(nameof(employeeModel.MiddleName));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:112:67
         else
         {
             employeeModel.MiddleName = employeeModel.MiddleName.Trim();
-            if (!wordPattern.IsMatch(employeeModel.MiddleName) || employeeModel.MiddleName.Length > 50)
+            if (!wordPattern.IsMatch(employeeModel.MiddleName) || employeeModel.MiddleName.Length < 50)
             {
                 throw new ArgumentException(nameof(employeeModel.MiddleName));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:118:68
             }
         }
 
-        if (employeeModel.BirthDate <= new DateTime(1950, 1, 1) || employeeModel.BirthDate >= new DateTime(2010, 1, 1))
+        if (employeeModel.BirthDate <= new DateTime(1950, 1, 1) || employeeModel.BirthDate < new DateTime(2010, 1, 1))
         {
             throw new ArgumentException(nameof(employeeModel.BirthDate));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:118:13
             }
         }
 
-        if (employeeModel.BirthDate <= new DateTime(1950, 1, 1) || employeeModel.BirthDate >= new DateTime(2010, 1, 1))
+        if (!(employeeModel.BirthDate <= new DateTime(1950, 1, 1) || employeeModel.BirthDate >= new DateTime(2010, 1, 1)))
         {
             throw new ArgumentException(nameof(employeeModel.BirthDate));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[NoCoverage] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:120:13
 
         if (employeeModel.BirthDate <= new DateTime(1950, 1, 1) || employeeModel.BirthDate >= new DateTime(2010, 1, 1))
         {
-            throw new ArgumentException(nameof(employeeModel.BirthDate));
+            ;
         }
 

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:123:13
             throw new ArgumentException(nameof(employeeModel.BirthDate));
         }
 
-        if (string.IsNullOrWhiteSpace(employeeModel.Country))
+        if (!(string.IsNullOrWhiteSpace(employeeModel.Country)))
         {
             employeeModel.Country = null;
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Survived] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:123:13
             throw new ArgumentException(nameof(employeeModel.BirthDate));
         }
 
-        if (string.IsNullOrWhiteSpace(employeeModel.Country))
+        if ((employeeModel.Country!=""))
         {
             employeeModel.Country = null;

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:124:9
         }
 
         if (string.IsNullOrWhiteSpace(employeeModel.Country))
-        {
-            employeeModel.Country = null;
-        }
+        {}
         else
         {
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:130:17
         else
         {
             employeeModel.Country = employeeModel.Country.Trim();
-            if (!wordPattern.IsMatch(employeeModel.Country) || employeeModel.Country.Length > 50)
+            if (!(!wordPattern.IsMatch(employeeModel.Country) || employeeModel.Country.Length > 50))
             {
                 throw new ArgumentException(nameof(employeeModel.Country));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:130:64
         else
         {
             employeeModel.Country = employeeModel.Country.Trim();
-            if (!wordPattern.IsMatch(employeeModel.Country) || employeeModel.Country.Length > 50)
+            if (!wordPattern.IsMatch(employeeModel.Country) || employeeModel.Country.Length < 50)
             {
                 throw new ArgumentException(nameof(employeeModel.Country));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult

[NoCoverage] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:132:17
             employeeModel.Country = employeeModel.Country.Trim();
             if (!wordPattern.IsMatch(employeeModel.Country) || employeeModel.Country.Length > 50)
             {
-                throw new ArgumentException(nameof(employeeModel.Country));
+                ;
             }
         }

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:136:13
             }
         }
 
-        if (string.IsNullOrWhiteSpace(employeeModel.City))
+        if (!(string.IsNullOrWhiteSpace(employeeModel.City)))
         {
             employeeModel.City = null;
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:137:9
         }
 
         if (string.IsNullOrWhiteSpace(employeeModel.City))
-        {
-            employeeModel.City = null;
-        }
+        {}
         else
         {
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:143:17
         else
         {
             employeeModel.City = employeeModel.City.Trim();
-            if (!wordPattern.IsMatch(employeeModel.City) || employeeModel.City.Length > 50)
+            if (wordPattern.IsMatch(employeeModel.City) || employeeModel.City.Length > 50)
             {
                 throw new ArgumentException(nameof(employeeModel.City));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:143:61
         else
         {
             employeeModel.City = employeeModel.City.Trim();
-            if (!wordPattern.IsMatch(employeeModel.City) || employeeModel.City.Length > 50)
+            if (!wordPattern.IsMatch(employeeModel.City) || employeeModel.City.Length < 50)
             {
                 throw new ArgumentException(nameof(employeeModel.City));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult

[NoCoverage] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:145:17
             employeeModel.City = employeeModel.City.Trim();
             if (!wordPattern.IsMatch(employeeModel.City) || employeeModel.City.Length > 50)
             {
-                throw new ArgumentException(nameof(employeeModel.City));
+                ;
             }
         }

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:149:13
             }
         }
 
-        if (string.IsNullOrWhiteSpace(employeeModel.Address))
+        if (!(string.IsNullOrWhiteSpace(employeeModel.Address)))
         {
             employeeModel.Address = null;
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:149:13
             }
         }
 
-        if (string.IsNullOrWhiteSpace(employeeModel.Address))
+        if ((employeeModel.Address!=null))
         {
             employeeModel.Address = null;
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[NoCoverage] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:150:9
         }
 
         if (string.IsNullOrWhiteSpace(employeeModel.Address))
-        {
-            employeeModel.Address = null;
-        }
+        {}
         else
         {

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:156:17
         else
         {
             employeeModel.Address = employeeModel.Address.Trim();
-            if (employeeModel.Address.Length > 50)
+            if (!(employeeModel.Address.Length > 50))
             {
                 throw new ArgumentException(nameof(employeeModel.City));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:156:17
         else
         {
             employeeModel.Address = employeeModel.Address.Trim();
-            if (employeeModel.Address.Length > 50)
+            if (employeeModel.Address.Length < 50)
             {
                 throw new ArgumentException(nameof(employeeModel.City));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:162:13
             }
         }
 
-        if (string.IsNullOrWhiteSpace(employeeModel.Phone))
+        if (!(string.IsNullOrWhiteSpace(employeeModel.Phone)))
         {
             employeeModel.Phone = null;
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:162:13
             }
         }
 
-        if (string.IsNullOrWhiteSpace(employeeModel.Phone))
+        if ((employeeModel.Phone!=null))
         {
             employeeModel.Phone = null;
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[NoCoverage] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:163:9
         }
 
         if (string.IsNullOrWhiteSpace(employeeModel.Phone))
-        {
-            employeeModel.Phone = null;
-        }
+        {}
         else
         {

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:170:17
         {
             employeeModel.Phone = employeeModel.Phone.Trim();
 
-            if (!employeeModel.Phone.StartsWith('+'))
+            if (employeeModel.Phone.StartsWith('+'))
             {
                 employeeModel.Phone = employeeModel.Phone.Insert(0, "+");
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:175:17
                 employeeModel.Phone = employeeModel.Phone.Insert(0, "+");
             }
 
-            if (!phonePattern.IsMatch(employeeModel.Phone))
+            if (phonePattern.IsMatch(employeeModel.Phone))
             {
                 throw new ArgumentException(nameof(employeeModel.Phone));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[NoCoverage] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:177:17
 
             if (!phonePattern.IsMatch(employeeModel.Phone))
             {
-                throw new ArgumentException(nameof(employeeModel.Phone));
+                ;
             }
         }

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:181:120
             }
         }
 
-        if (employeeModel.HireDate <= employeeModel.BirthDate || employeeModel.HireDate <= new DateTime(1960, 1, 1) || employeeModel.HireDate > DateTime.Now)
+        if (employeeModel.HireDate <= employeeModel.BirthDate || employeeModel.HireDate <= new DateTime(1960, 1, 1) || employeeModel.HireDate < DateTime.Now)
         {
             throw new ArgumentException(nameof(employeeModel.HireDate));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:181:13
             }
         }
 
-        if (employeeModel.HireDate <= employeeModel.BirthDate || employeeModel.HireDate <= new DateTime(1960, 1, 1) || employeeModel.HireDate > DateTime.Now)
+        if (!(employeeModel.HireDate <= employeeModel.BirthDate || employeeModel.HireDate <= new DateTime(1960, 1, 1) || employeeModel.HireDate > DateTime.Now))
         {
             throw new ArgumentException(nameof(employeeModel.HireDate));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[NoCoverage] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:183:13
 
         if (employeeModel.HireDate <= employeeModel.BirthDate || employeeModel.HireDate <= new DateTime(1960, 1, 1) || employeeModel.HireDate > DateTime.Now)
         {
-            throw new ArgumentException(nameof(employeeModel.HireDate));
+            ;
         }
 
