[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:186:13
             throw new ArgumentException(nameof(employeeModel.HireDate));
         }
 
-        if (employeeModel.Salary <= 0)
+        if (employeeModel.Salary > 0)
         {
             throw new ArgumentException(nameof(employeeModel.Salary));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:186:13
             throw new ArgumentException(nameof(employeeModel.HireDate));
         }
 
-        if (employeeModel.Salary <= 0)
+        if (!(employeeModel.Salary <= 0))
         {
             throw new ArgumentException(nameof(employeeModel.Salary));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[NoCoverage] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:188:13
 
         if (employeeModel.Salary <= 0)
         {
-            throw new ArgumentException(nameof(employeeModel.Salary));
+            ;
         }
 

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:191:13
             throw new ArgumentException(nameof(employeeModel.Salary));
         }
 
-        if (employeeModel.DepartmentId <= 0)
+        if (!(employeeModel.DepartmentId <= 0))
         {
             throw new ArgumentException(nameof(employeeModel.DepartmentId));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:191:13
             throw new ArgumentException(nameof(employeeModel.Salary));
         }
 
-        if (employeeModel.DepartmentId <= 0)
+        if (employeeModel.DepartmentId > 0)
         {
             throw new ArgumentException(nameof(employeeModel.DepartmentId));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[NoCoverage] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:193:13
 
         if (employeeModel.DepartmentId <= 0)
         {
-            throw new ArgumentException(nameof(employeeModel.DepartmentId));
+            ;
         }
 

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:196:13
             throw new ArgumentException(nameof(employeeModel.DepartmentId));
         }
 
-        if (employeeModel.PositionId <= 0)
+        if (employeeModel.PositionId > 0)
         {
             throw new ArgumentException(nameof(employeeModel.PositionId));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:196:13
             throw new ArgumentException(nameof(employeeModel.DepartmentId));
         }
 
-        if (employeeModel.PositionId <= 0)
+        if (!(employeeModel.PositionId <= 0))
         {
             throw new ArgumentException(nameof(employeeModel.PositionId));
killedBy: Gpt5MiniUnitTests.EmployeeServiceTests.UpdateAsync_ValidModel_CallsRepositoryUpdateAndReturnsResult; Gpt5MiniUnitTests.EmployeeServiceTests.AddAsync_ValidModel_TrimsAndNormalizesAndCallsRepository

[NoCoverage] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:198:13
 
         if (employeeModel.PositionId <= 0)
         {
-            throw new ArgumentException(nameof(employeeModel.PositionId));
+            ;
         }
     }
