[Killed] Conditional (false) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample20.cs:7:22
 {
     public void Shuffle(T[] array, int? seed = null)
     {
-        var random = seed is null
-            ? new Random()
-            : new Random(seed.Value);
+        var random = (false?new Random()
+:new Random(seed.Value));
 
         for (var i = array.Length - 1; i > 0; i--)
killedBy: Gpt5MiniUnitTests.FisherYatesShufflerTests.Shuffle_WithoutSeed_PreservesElements; Gpt5MiniUnitTests.FisherYatesShufflerTests.Shuffle_WithoutSeed_PreservesElements; Gpt5MiniUnitTests.FisherYatesShufflerTests.Shuffle_WithoutSeed_PreservesElements

[Killed] Conditional (true) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample20.cs:7:22
 {
     public void Shuffle(T[] array, int? seed = null)
     {
-        var random = seed is null
-            ? new Random()
-            : new Random(seed.Value);
+        var random = (true?new Random()
+:new Random(seed.Value));
 
         for (var i = array.Length - 1; i > 0; i--)
killedBy: Gpt5MiniUnitTests.FisherYatesShufflerTests.Shuffle_WithSeed_ProducesExpectedPermutation; Gpt5MiniUnitTests.FisherYatesShufflerTests.Shuffle_WithSeed_IsDeterministicAcrossInstances

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample20.cs:11:22
             ? new Random()
             : new Random(seed.Value);
 
-        for (var i = array.Length - 1; i > 0; i--)
+        for (var i = array.Length + 1; i > 0; i--)
         {
             var j = random.Next(0, i + 1);
killedBy: Gpt5MiniUnitTests.FisherYatesShufflerTests.Shuffle_WithoutSeed_PreservesElements; Gpt5MiniUnitTests.FisherYatesShufflerTests.Shuffle_WithoutSeed_PreservesElements; Gpt5MiniUnitTests.FisherYatesShufflerTests.Shuffle_WithoutSeed_PreservesElements

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample20.cs:11:40
             ? new Random()
             : new Random(seed.Value);
 
-        for (var i = array.Length - 1; i > 0; i--)
+        for (var i = array.Length - 1; i < 0; i--)
         {
             var j = random.Next(0, i + 1);
killedBy: Gpt5MiniUnitTests.FisherYatesShufflerTests.Shuffle_WithoutSeed_PreservesElements; Gpt5MiniUnitTests.FisherYatesShufflerTests.Shuffle_EmptyArray_RemainsUnchanged; Gpt5MiniUnitTests.FisherYatesShufflerTests.Shuffle_WithSeed_ProducesExpectedPermutation

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample20.cs:13:36
 
         for (var i = array.Length - 1; i > 0; i--)
         {
-            var j = random.Next(0, i + 1);
+            var j = random.Next(0, i - 1);
 
             (array[i], array[j]) = (array[j], array[i]);
killedBy: Gpt5MiniUnitTests.FisherYatesShufflerTests.Shuffle_WithSeed_ProducesExpectedPermutation
