[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:11:5
     private readonly IRepository<NoteEntity> _notes;
 
     public NoteService(IUnitOfWork unitOfWork)
-    {
-        _unitOfWork = unitOfWork;
-        _notes = _unitOfWork.GetRepository<NoteEntity>();
-    }
+    {}
 
     public async Task<ICollection<NoteModel>> GetAllByUserIdAsync(int userId)
killedBy: Gpt5MiniUnitTests.NoteServiceTests.AddAsync_WhenAddThrows_RollsBackAndPropagates; Gpt5MiniUnitTests.NoteServiceTests.GetByIdAsync_WhenNotFound_ThrowsNoteNotFoundException; Gpt5MiniUnitTests.NoteServiceTests.GetByIdAsync_WhenNoteExists_ReturnsMappedModel

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:18:60
 
     public async Task<ICollection<NoteModel>> GetAllByUserIdAsync(int userId)
     {
-        var noteEntityList = await _notes.GetAllAsync(n => n.UserId == userId);
+        var noteEntityList = await _notes.GetAllAsync(n => n.UserId != userId);
         return noteEntityList.Select(e => MapEntityToModel(e)).ToList();
     }
killedBy: Gpt5MiniUnitTests.NoteServiceTests.GetAllByUserIdAsync_WhenCalled_ReturnsMappedNoteModels

[Killed] Null coalescing mutation (remove right)
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:24:26
 
     public async Task<NoteModel> GetByIdAsync(int id)
     {
-        var noteEntity = await _notes.GetByIdAsync(id)
-            ?? throw new NoteNotFoundException();
+        var noteEntity = await _notes.GetByIdAsync(id);
         return MapEntityToModel(noteEntity);
     }
killedBy: Gpt5MiniUnitTests.NoteServiceTests.GetByIdAsync_WhenNotFound_ThrowsNoteNotFoundException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:31:34
 
     public async Task<int> AddAsync(NoteModel noteModel)
     {
-        if (noteModel == null || noteModel.Content == null)
+        if (noteModel == null || noteModel.Content != null)
         {
             throw new NoteNotFoundException();
killedBy: Gpt5MiniUnitTests.NoteServiceTests.AddAsync_InvalidUserId_ThrowsUserNotFoundException; Gpt5MiniUnitTests.NoteServiceTests.AddAsync_InvalidUserId_ThrowsUserNotFoundException; Gpt5MiniUnitTests.NoteServiceTests.AddAsync_WhenAddThrows_RollsBackAndPropagates

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:31:13
 
     public async Task<int> AddAsync(NoteModel noteModel)
     {
-        if (noteModel == null || noteModel.Content == null)
+        if (noteModel != null || noteModel.Content == null)
         {
             throw new NoteNotFoundException();
killedBy: Gpt5MiniUnitTests.NoteServiceTests.AddAsync_InvalidUserId_ThrowsUserNotFoundException; Gpt5MiniUnitTests.NoteServiceTests.AddAsync_InvalidUserId_ThrowsUserNotFoundException; Gpt5MiniUnitTests.NoteServiceTests.AddAsync_WhenAddThrows_RollsBackAndPropagates

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:33:13
     {
         if (noteModel == null || noteModel.Content == null)
         {
-            throw new NoteNotFoundException();
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.NoteServiceTests.AddAsync_NullContent_ThrowsNoteNotFoundException; Gpt5MiniUnitTests.NoteServiceTests.AddAsync_NullModel_ThrowsNoteNotFoundException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:36:13
             throw new NoteNotFoundException();
         }
 
-        if (noteModel.UserId <= 0)
+        if (noteModel.UserId < 0)
         {
             throw new UserNotFoundException();
killedBy: Gpt5MiniUnitTests.NoteServiceTests.AddAsync_InvalidUserId_ThrowsUserNotFoundException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:36:13
             throw new NoteNotFoundException();
         }
 
-        if (noteModel.UserId <= 0)
+        if (noteModel.UserId > 0)
         {
             throw new UserNotFoundException();
killedBy: Gpt5MiniUnitTests.NoteServiceTests.AddAsync_InvalidUserId_ThrowsUserNotFoundException; Gpt5MiniUnitTests.NoteServiceTests.AddAsync_InvalidUserId_ThrowsUserNotFoundException; Gpt5MiniUnitTests.NoteServiceTests.AddAsync_WhenAddThrows_RollsBackAndPropagates

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:38:13
 
         if (noteModel.UserId <= 0)
         {
-            throw new UserNotFoundException();
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.NoteServiceTests.AddAsync_InvalidUserId_ThrowsUserNotFoundException; Gpt5MiniUnitTests.NoteServiceTests.AddAsync_InvalidUserId_ThrowsUserNotFoundException

[Survived] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:54:13
         {
             var addedNoteEntity = await _notes.AddAsync(noteEntity);
 
-            await _unitOfWork.SaveAsync();
+            ;
             await transaction.CommitAsync();
 

[Survived] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:55:13
             var addedNoteEntity = await _notes.AddAsync(noteEntity);
 
             await _unitOfWork.SaveAsync();
-            await transaction.CommitAsync();
+            ;
 
             return addedNoteEntity.Id;

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:61:13
         }
         catch
         {
-            await transaction.RollbackAsync();
+            ;
             throw;
         }
killedBy: Gpt5MiniUnitTests.NoteServiceTests.AddAsync_WhenAddThrows_RollsBackAndPropagates

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:62:13
         catch
         {
             await transaction.RollbackAsync();
-            throw;
+            ;
         }
     }
killedBy: Gpt5MiniUnitTests.NoteServiceTests.AddAsync_WhenAddThrows_RollsBackAndPropagates

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:68:13
 
     public async Task<int> UpdateAsync(NoteModel noteModel)
     {
-        if (noteModel == null || noteModel.Content == null)
+        if (!(noteModel == null || noteModel.Content == null))
         {
             throw new NoteNotFoundException();
killedBy: Gpt5MiniUnitTests.NoteServiceTests.UpdateAsync_Success_ReturnsUpdatedIdAndCommits; Gpt5MiniUnitTests.NoteServiceTests.UpdateAsync_WhenUpdateThrows_RollsBackAndPropagates; Gpt5MiniUnitTests.NoteServiceTests.UpdateAsync_UserMismatch_ThrowsUserNotFoundException

[Killed] Null coalescing mutation (remove right)
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:73:29
             throw new NoteNotFoundException();
         }
 
-        var oldNoteEntity = await _notes.FirstOrDefaultAsNoTrackingAsync(e => e.Id == noteModel.Id)
-            ?? throw new NoteNotFoundException();
+        var oldNoteEntity = await _notes.FirstOrDefaultAsNoTrackingAsync(e => e.Id == noteModel.Id);
 
         if (oldNoteEntity.UserId != noteModel.UserId)
killedBy: Gpt5MiniUnitTests.NoteServiceTests.UpdateAsync_OldNoteNotFound_ThrowsNoteNotFoundException

[NoCoverage] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:73:79
             throw new NoteNotFoundException();
         }
 
-        var oldNoteEntity = await _notes.FirstOrDefaultAsNoTrackingAsync(e => e.Id == noteModel.Id)
+        var oldNoteEntity = await _notes.FirstOrDefaultAsNoTrackingAsync(e => e.Id != noteModel.Id)
             ?? throw new NoteNotFoundException();
 

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:76:13
         var oldNoteEntity = await _notes.FirstOrDefaultAsNoTrackingAsync(e => e.Id == noteModel.Id)
             ?? throw new NoteNotFoundException();
 
-        if (oldNoteEntity.UserId != noteModel.UserId)
+        if (oldNoteEntity.UserId == noteModel.UserId)
         {
             throw new UserNotFoundException();
killedBy: Gpt5MiniUnitTests.NoteServiceTests.UpdateAsync_Success_ReturnsUpdatedIdAndCommits; Gpt5MiniUnitTests.NoteServiceTests.UpdateAsync_WhenUpdateThrows_RollsBackAndPropagates; Gpt5MiniUnitTests.NoteServiceTests.UpdateAsync_UserMismatch_ThrowsUserNotFoundException

[Killed] Object initializer mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:130:16
 
     private NoteModel MapEntityToModel(NoteEntity noteEntity)
     {
-        return new NoteModel()
-        {
-            Id = noteEntity.Id,
-            Title = noteEntity.Title,
-            Content = noteEntity.Content,
-            CreatedAt = noteEntity.CreatedAt,
-            ModifiedAt = noteEntity.ModifiedAt,
-            UserId = noteEntity.UserId
-        };
+        return new NoteModel()
+{};
     }
 
killedBy: Gpt5MiniUnitTests.NoteServiceTests.GetByIdAsync_WhenNoteExists_ReturnsMappedModel; Gpt5MiniUnitTests.NoteServiceTests.GetAllByUserIdAsync_WhenCalled_ReturnsMappedNoteModels

[Killed] Object initializer mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample3.cs:143:16
 
     private NoteEntity MapModelToEntity(NoteModel noteModel)
     {
-        return new NoteEntity()
-        {
-            Id = noteModel.Id,
-            Title = noteModel.Title,
-            Content = noteModel.Content,
-            CreatedAt = noteModel.CreatedAt,
-            ModifiedAt = noteModel.ModifiedAt,
-            UserId = noteModel.UserId
-        };
+        return new NoteEntity()
+{};
     }
 }
killedBy: Gpt5MiniUnitTests.NoteServiceTests.UpdateAsync_Success_ReturnsUpdatedIdAndCommits
