[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample4.cs:11:5
     private readonly IMapper _mapper;
 
     public CompanyService(ICompanyRepository companyRepository, IMapper mapper)
-    {
-        _companyRepository = companyRepository;
-        _mapper = mapper;
-    }
+    {}
 
     public async Task<CompanyModel> GetAsync(int id = 1)
killedBy: Gpt5MiniUnitTests.CompanyServiceTests.GetAsync_WithSpecificId_PassesIdToRepositoryAndReturnsMappedModel; Gpt5MiniUnitTests.CompanyServiceTests.GetAsync_WhenCalledWithDefaultId_ReturnsMappedCompanyModel; Gpt5MiniUnitTests.CompanyServiceTests.GetAsync_WhenRepositoryReturnsNull_MapperCalledWithNullAndReturnsNullModel

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample4.cs:17:5
     }
 
     public async Task<CompanyModel> GetAsync(int id = 1)
-    {
-        var result = await _companyRepository.GetAsync(id);
-        return _mapper.Map<CompanyModel>(result);
-    }
+    {}
 }
 
killedBy: Gpt5MiniUnitTests.CompanyServiceTests.GetAsync_WithSpecificId_PassesIdToRepositoryAndReturnsMappedModel; Gpt5MiniUnitTests.CompanyServiceTests.GetAsync_WhenCalledWithDefaultId_ReturnsMappedCompanyModel; Gpt5MiniUnitTests.CompanyServiceTests.GetAsync_WhenRepositoryReturnsNull_MapperCalledWithNullAndReturnsNullModel
