[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:8:5
     private readonly IFolderRepository _folderRepository;
 
     public FolderService(IFolderRepository folderRepository)
-    {
-        _folderRepository = folderRepository;
-    }
+    {}
 
     public async Task<FolderDTO> GetFolderAsync(string? path)
killedBy: Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_ValidFolder_CallsRepositoryAndReturnsId; Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_IntermediateMissing_ThrowsFolderNotFoundException; Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_PathIsNull_ReturnsRootWithSubFolders

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:14:13
 
     public async Task<FolderDTO> GetFolderAsync(string? path)
     {
-        if (path == null)
+        if (path != null)
         {
             var rootFolders = await GetRootFoldersAsync();
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_IntermediateMissing_ThrowsFolderNotFoundException; Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_PathIsNull_ReturnsRootWithSubFolders; Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_ReturnsFolderDtoWithSubfolders

[Killed] Object initializer mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:18:26
         {
             var rootFolders = await GetRootFoldersAsync();
 
-            var result = new FolderDTO()
-            {
-                Id = 0,
-                Name = "Root",
-                SubFolders = rootFolders,
-                ParentId = null,
-            };
+            var result = new FolderDTO()
+{};
 
             return result;
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_PathIsNull_ReturnsRootWithSubFolders

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:21:24
             var result = new FolderDTO()
             {
                 Id = 0,
-                Name = "Root",
+                Name = "",
                 SubFolders = rootFolders,
                 ParentId = null,
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_PathIsNull_ReturnsRootWithSubFolders

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:33:13
 
         var folder = await _folderRepository.GetFolderByNameAsync(folderNames[0]);
 
-        if (folder == null)
+        if (folder != null)
         {
             throw new FolderNotFoundException($"Invalid Request. Folder `{folderNames[0]}` does not exist.");
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_IntermediateMissing_ThrowsFolderNotFoundException; Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_ReturnsFolderDtoWithSubfolders; Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_FolderDoesNotExist_ThrowsFolderNotFoundException

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:35:13
 
         if (folder == null)
         {
-            throw new FolderNotFoundException($"Invalid Request. Folder `{folderNames[0]}` does not exist.");
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_FolderDoesNotExist_ThrowsFolderNotFoundException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:38:25
             throw new FolderNotFoundException($"Invalid Request. Folder `{folderNames[0]}` does not exist.");
         }
 
-        for (int i = 1; i < folderNames.Length; i++)
+        for (int i = 1; i <= folderNames.Length; i++)
         {
             bool checksum = false;
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_ReturnsFolderDtoWithSubfolders

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:38:49
             throw new FolderNotFoundException($"Invalid Request. Folder `{folderNames[0]}` does not exist.");
         }
 
-        for (int i = 1; i < folderNames.Length; i++)
+        for (int i = 1; i < folderNames.Length; i--)
         {
             bool checksum = false;
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_ReturnsFolderDtoWithSubfolders

[Killed] Boolean mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:40:29
 
         for (int i = 1; i < folderNames.Length; i++)
         {
-            bool checksum = false;
+            bool checksum = true;
 
             foreach (var subfolder in folder!.SubFolders)
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_IntermediateMissing_ThrowsFolderNotFoundException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:44:21
 
             foreach (var subfolder in folder!.SubFolders)
             {
-                if (folderNames[i] == subfolder.Name)
+                if (folderNames[i] != subfolder.Name)
                 {
                     folder = await _folderRepository.GetFolderByNameAsync(folderNames[i], folder.Id);
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_IntermediateMissing_ThrowsFolderNotFoundException; Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_ReturnsFolderDtoWithSubfolders

[Killed] Boolean mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:47:32
                 if (folderNames[i] == subfolder.Name)
                 {
                     folder = await _folderRepository.GetFolderByNameAsync(folderNames[i], folder.Id);
-                    checksum = true;
+                    checksum = false;
                     break;
                 }
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_ReturnsFolderDtoWithSubfolders

[Survived] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:48:21
                 {
                     folder = await _folderRepository.GetFolderByNameAsync(folderNames[i], folder.Id);
                     checksum = true;
-                    break;
+                    ;
                 }
             }

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:52:17
                 }
             }
 
-            if (!checksum)
+            if (checksum)
             {
                 throw new FolderNotFoundException($"Invalid Request. Folder `{folderNames[i]}` does not exist.");
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_IntermediateMissing_ThrowsFolderNotFoundException; Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_ReturnsFolderDtoWithSubfolders

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:54:17
 
             if (!checksum)
             {
-                throw new FolderNotFoundException($"Invalid Request. Folder `{folderNames[i]}` does not exist.");
+                ;
             }
         }
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_IntermediateMissing_ThrowsFolderNotFoundException

[Killed] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:54:51
 
             if (!checksum)
             {
-                throw new FolderNotFoundException($"Invalid Request. Folder `{folderNames[i]}` does not exist.");
+                throw new FolderNotFoundException($"");
             }
         }
killedBy: Gpt5MiniUnitTests.FolderServiceTests.GetFolderAsync_NestedPath_IntermediateMissing_ThrowsFolderNotFoundException

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:101:9
 
     public async Task<int> AddFolderAsync(FolderDTO folderDto)
     {
-        await ValidateFolderDto(folderDto);
+        ;
 
         FolderEntity folderEntity = new ()
killedBy: Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidParentId_ThrowsArgumentException; Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidParentId_ThrowsArgumentException; Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidName_ThrowsArgumentException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:116:13
 
     private async Task ValidateFolderDto(FolderDTO folderDto)
     {
-        if (folderDto == null)
+        if (folderDto != null)
         {
             throw new ArgumentNullException(nameof(folderDto));
killedBy: Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidParentId_ThrowsArgumentException; Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidParentId_ThrowsArgumentException; Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidName_ThrowsArgumentException

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:118:13
     {
         if (folderDto == null)
         {
-            throw new ArgumentNullException(nameof(folderDto));
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_NullFolderDto_ThrowsArgumentNullException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:121:85
             throw new ArgumentNullException(nameof(folderDto));
         }
 
-        if (string.IsNullOrEmpty(folderDto.Name) || folderDto.Name.Contains("/") || folderDto.Name.Length > 255)
+        if (string.IsNullOrEmpty(folderDto.Name) || folderDto.Name.Contains("/") || folderDto.Name.Length < 255)
         {
             throw new ArgumentException(nameof(folderDto.Name));
killedBy: Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_ValidFolder_CallsRepositoryAndReturnsId

[Killed] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:121:13
             throw new ArgumentNullException(nameof(folderDto));
         }
 
-        if (string.IsNullOrEmpty(folderDto.Name) || folderDto.Name.Contains("/") || folderDto.Name.Length > 255)
+        if (string.IsNullOrEmpty(folderDto.Name) || folderDto.Name.Contains("/") && folderDto.Name.Length > 255)
         {
             throw new ArgumentException(nameof(folderDto.Name));
killedBy: Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidName_ThrowsArgumentException; Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidName_ThrowsArgumentException

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:123:13
 
         if (string.IsNullOrEmpty(folderDto.Name) || folderDto.Name.Contains("/") || folderDto.Name.Length > 255)
         {
-            throw new ArgumentException(nameof(folderDto.Name));
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidName_ThrowsArgumentException; Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidName_ThrowsArgumentException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:126:13
             throw new ArgumentException(nameof(folderDto.Name));
         }
 
-        if (folderDto.ParentId <= 0)
+        if (folderDto.ParentId > 0)
         {
             throw new ArgumentException(nameof(folderDto.ParentId));
killedBy: Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidParentId_ThrowsArgumentException; Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidParentId_ThrowsArgumentException; Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_ValidFolder_CallsRepositoryAndReturnsId

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:126:13
             throw new ArgumentException(nameof(folderDto.Name));
         }
 
-        if (folderDto.ParentId <= 0)
+        if (folderDto.ParentId < 0)
         {
             throw new ArgumentException(nameof(folderDto.ParentId));
killedBy: Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidParentId_ThrowsArgumentException

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:128:13
 
         if (folderDto.ParentId <= 0)
         {
-            throw new ArgumentException(nameof(folderDto.ParentId));
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidParentId_ThrowsArgumentException; Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_InvalidParentId_ThrowsArgumentException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:131:13
             throw new ArgumentException(nameof(folderDto.ParentId));
         }
 
-        if (await _folderRepository.GetFolderByNameAsync(folderDto.Name, folderDto.ParentId) != null)
+        if (await _folderRepository.GetFolderByNameAsync(folderDto.Name, folderDto.ParentId) == null)
         {
             throw new ArgumentException(nameof(folderDto.Name));
killedBy: Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_ValidFolder_CallsRepositoryAndReturnsId; Gpt5MiniUnitTests.FolderServiceTests.AddFolderAsync_DuplicateName_ThrowsArgumentException
