[Killed] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:14:13
 
     public void AddLot(LotDTO lot)
     {
-        if (lot == null || lot.Sold == true || lot.Name == null || lot.Owner == null || lot.Category == null)
+        if (lot == null || lot.Sold == true || lot.Name == null && lot.Owner == null || lot.Category == null)
         {
             throw new InvalidLotException();
killedBy: Gpt5MiniUnitTests.LotServiceTests.AddLot_MissingRequiredFields_ThrowsInvalidLotException; Gpt5MiniUnitTests.LotServiceTests.AddLot_MissingRequiredFields_ThrowsInvalidLotException; Gpt5MiniUnitTests.LotServiceTests.AddLot_NullLot_ThrowsInvalidLotException

[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:14:13
 
     public void AddLot(LotDTO lot)
     {
-        if (lot == null || lot.Sold == true || lot.Name == null || lot.Owner == null || lot.Category == null)
+        if (!(lot == null || lot.Sold == true || lot.Name == null || lot.Owner == null || lot.Category == null))
         {
             throw new InvalidLotException();
killedBy: Gpt5MiniUnitTests.LotServiceTests.AddLot_MissingRequiredFields_ThrowsInvalidLotException; Gpt5MiniUnitTests.LotServiceTests.AddLot_MissingRequiredFields_ThrowsInvalidLotException; Gpt5MiniUnitTests.LotServiceTests.AddLot_MissingRequiredFields_ThrowsInvalidLotException

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:16:13
     {
         if (lot == null || lot.Sold == true || lot.Name == null || lot.Owner == null || lot.Category == null)
         {
-            throw new InvalidLotException();
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.LotServiceTests.AddLot_MissingRequiredFields_ThrowsInvalidLotException; Gpt5MiniUnitTests.LotServiceTests.AddLot_MissingRequiredFields_ThrowsInvalidLotException; Gpt5MiniUnitTests.LotServiceTests.AddLot_MissingRequiredFields_ThrowsInvalidLotException

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:21:9
 
         lot.Auction = new AuctionDTO();
 
-        _database.Lots.Add(_mapper.Map<LotDTO, Lot>(lot));
+        ;
         _database.Commit();
     }
killedBy: Gpt5MiniUnitTests.LotServiceTests.AddLot_Valid_AddsAndCommitsAndSetsAuction

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:22:9
         lot.Auction = new AuctionDTO();
 
         _database.Lots.Add(_mapper.Map<LotDTO, Lot>(lot));
-        _database.Commit();
+        ;
     }
 
killedBy: Gpt5MiniUnitTests.LotServiceTests.AddLot_Valid_AddsAndCommitsAndSetsAuction

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:27:13
 
     public void DeleteLot(int id)
     {
-        if (id <= 0)
+        if (id < 0)
         {
             throw new InvalidIdException();
killedBy: Gpt5MiniUnitTests.LotServiceTests.DeleteLot_InvalidId_ThrowsInvalidIdException

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:32:9
             throw new InvalidIdException();
         }
 
-        _database.Auctions.Delete(id);
+        ;
         _database.Lots.Delete(id);
         _database.Commit();
killedBy: Gpt5MiniUnitTests.LotServiceTests.DeleteLot_Valid_DeletesAuctionsAndLotsAndCommits

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:33:9
         }
 
         _database.Auctions.Delete(id);
-        _database.Lots.Delete(id);
+        ;
         _database.Commit();
     }
killedBy: Gpt5MiniUnitTests.LotServiceTests.DeleteLot_Valid_DeletesAuctionsAndLotsAndCommits

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:34:9
 
         _database.Auctions.Delete(id);
         _database.Lots.Delete(id);
-        _database.Commit();
+        ;
     }
 
killedBy: Gpt5MiniUnitTests.LotServiceTests.DeleteLot_Valid_DeletesAuctionsAndLotsAndCommits

[Killed] Null coalescing mutation (remove right)
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:44:19
             throw new InvalidIdException();
         }
 
-        var lot = _mapper.Map<Lot, LotDTO>(_database.Lots.Get(id))
-            ?? throw new InvalidIdException();
+        var lot = _mapper.Map<Lot, LotDTO>(_database.Lots.Get(id));
 
         return lot;
killedBy: Gpt5MiniUnitTests.LotServiceTests.GetLot_NotFound_ThrowsInvalidIdException

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:51:5
     }
 
     public IEnumerable<LotDTO> GetLots()
-    {
-        return _mapper.Map<IEnumerable<Lot>, IEnumerable<LotDTO>>(_database.Lots.GetAll());
-    }
+    {}
 
     public IEnumerable<LotDTO> GetLotsByCategory(string category)
killedBy: Gpt5MiniUnitTests.LotServiceTests.GetLots_ReturnsMappedCollection

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:57:13
 
     public IEnumerable<LotDTO> GetLotsByCategory(string category)
     {
-        if (category == null)
+        if (category != null)
         {
             throw new InvalidCategoryException();
killedBy: Gpt5MiniUnitTests.LotServiceTests.GetLotsByCategory_NullCategory_ThrowsInvalidCategoryException; Gpt5MiniUnitTests.LotServiceTests.GetLotsByCategory_Valid_ReturnsMapped

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:59:13
     {
         if (category == null)
         {
-            throw new InvalidCategoryException();
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.LotServiceTests.GetLotsByCategory_NullCategory_ThrowsInvalidCategoryException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:67:13
 
     public IEnumerable<LotDTO> GetLotsByName(string name)
     {
-        if (name == null)
+        if (name != null)
         {
             throw new InvalidNameException();
killedBy: Gpt5MiniUnitTests.LotServiceTests.GetLotsByName_NullName_ThrowsInvalidNameException; Gpt5MiniUnitTests.LotServiceTests.GetLotsByName_Valid_ReturnsMapped

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:76:5
     }
 
     public IEnumerable<LotDTO> GetNotSoldLots()
-    {
-        return _mapper.Map<IEnumerable<Lot>, IEnumerable<LotDTO>>(_database.Lots.GetNotSoldLots());
-    }
+    {}
 
     public IEnumerable<LotDTO> GetSoldLots()
killedBy: Gpt5MiniUnitTests.LotServiceTests.GetNotSoldLots_ReturnsMapped

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:81:5
     }
 
     public IEnumerable<LotDTO> GetSoldLots()
-    {
-        return _mapper.Map<IEnumerable<Lot>, IEnumerable<LotDTO>>(_database.Lots.GetSoldLots());
-    }
+    {}
 
     public void UpdateLot(LotDTO lotDto)
killedBy: Gpt5MiniUnitTests.LotServiceTests.GetSoldLots_ReturnsMapped

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:87:78
 
     public void UpdateLot(LotDTO lotDto)
     {
-        if (lotDto == null || lotDto.Name == null || lotDto.Owner == null || lotDto.Category == null)
+        if (lotDto == null || lotDto.Name == null || lotDto.Owner == null || lotDto.Category != null)
         {
             throw new InvalidLotException();
killedBy: Gpt5MiniUnitTests.LotServiceTests.UpdateLot_MissingRequiredFields_ThrowsInvalidLotException; Gpt5MiniUnitTests.LotServiceTests.UpdateLot_Valid_UpdatesEntityAndCommits; Gpt5MiniUnitTests.LotServiceTests.UpdateLot_LotNotFound_ThrowsInvalidIdException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:87:13
 
     public void UpdateLot(LotDTO lotDto)
     {
-        if (lotDto == null || lotDto.Name == null || lotDto.Owner == null || lotDto.Category == null)
+        if (lotDto != null || lotDto.Name == null || lotDto.Owner == null || lotDto.Category == null)
         {
             throw new InvalidLotException();
killedBy: Gpt5MiniUnitTests.LotServiceTests.UpdateLot_Null_ThrowsInvalidLotException; Gpt5MiniUnitTests.LotServiceTests.UpdateLot_Valid_UpdatesEntityAndCommits; Gpt5MiniUnitTests.LotServiceTests.UpdateLot_LotNotFound_ThrowsInvalidIdException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:94:13
 
         var lot = _database.Lots.Get(lotDto.ID);
 
-        if (lot == null)
+        if (lot != null)
         {
             throw new InvalidIdException();
killedBy: Gpt5MiniUnitTests.LotServiceTests.UpdateLot_Valid_UpdatesEntityAndCommits; Gpt5MiniUnitTests.LotServiceTests.UpdateLot_LotNotFound_ThrowsInvalidIdException

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:105:9
         lot.Category = lotDto.Category;
         lot.Details = lotDto.Details;
 
-        _database.Lots.Update(lot);
+        ;
         _database.Commit();
     }
killedBy: Gpt5MiniUnitTests.LotServiceTests.UpdateLot_Valid_UpdatesEntityAndCommits

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:106:9
         lot.Details = lotDto.Details;
 
         _database.Lots.Update(lot);
-        _database.Commit();
+        ;
     }
 }
killedBy: Gpt5MiniUnitTests.LotServiceTests.UpdateLot_Valid_UpdatesEntityAndCommits

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample6.cs:116:5
     protected readonly IMapper _mapper;
 
     protected Service(IUnitOfWork database, IMapper mapper)
-    {
-        _database = database;
-        _mapper = mapper;
-    }
+    {}
 }
 
killedBy: Gpt5MiniUnitTests.LotServiceTests.GetLot_NotFound_ThrowsInvalidIdException; Gpt5MiniUnitTests.LotServiceTests.AddLot_Valid_AddsAndCommitsAndSetsAuction; Gpt5MiniUnitTests.LotServiceTests.GetSoldLots_ReturnsMapped
