[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:9:13
     {
         if (source.GetLength(0) != source.GetLength(1))
         {
-            throw new ArgumentException("Source matrix is not square shaped.");
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.LuTests.Decompose_NonSquare_ThrowsArgumentException

[Survived] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:9:41
     {
         if (source.GetLength(0) != source.GetLength(1))
         {
-            throw new ArgumentException("Source matrix is not square shaped.");
+            throw new ArgumentException("");
         }
 

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:16:36
         var lower = new double[pivot, pivot];
         var upper = new double[pivot, pivot];
 
-        for (var i = 0; i < pivot; i++)
+        for (var i = 0; i < pivot; i--)
         {
             for (var k = i; k < pivot; k++)
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource; Gpt5MiniUnitTests.LuTests.Eliminate_SingularMatrix_ReturnsNaNValues

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:16:25
         var lower = new double[pivot, pivot];
         var upper = new double[pivot, pivot];
 
-        for (var i = 0; i < pivot; i++)
+        for (var i = 0; i > pivot; i++)
         {
             for (var k = i; k < pivot; k++)
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource; Gpt5MiniUnitTests.LuTests.Eliminate_1x1Matrix_ReturnsSolution

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:18:29
 
         for (var i = 0; i < pivot; i++)
         {
-            for (var k = i; k < pivot; k++)
+            for (var k = i; k <= pivot; k++)
             {
                 double sum = 0;
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource; Gpt5MiniUnitTests.LuTests.Eliminate_SingularMatrix_ReturnsNaNValues

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:18:29
 
         for (var i = 0; i < pivot; i++)
         {
-            for (var k = i; k < pivot; k++)
+            for (var k = i; k > pivot; k++)
             {
                 double sum = 0;
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource; Gpt5MiniUnitTests.LuTests.Eliminate_1x1Matrix_ReturnsSolution

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:22:40
             {
                 double sum = 0;
 
-                for (var j = 0; j < i; j++)
+                for (var j = 0; j < i; j--)
                 {
                     sum += lower[i, j] * upper[j, k];
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource; Gpt5MiniUnitTests.LuTests.Eliminate_SingularMatrix_ReturnsNaNValues

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:22:33
             {
                 double sum = 0;
 
-                for (var j = 0; j < i; j++)
+                for (var j = 0; j > i; j++)
                 {
                     sum += lower[i, j] * upper[j, k];
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:24:21
 
                 for (var j = 0; j < i; j++)
                 {
-                    sum += lower[i, j] * upper[j, k];
+                    sum -= lower[i, j] * upper[j, k];
                 }
 
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:24:28
 
                 for (var j = 0; j < i; j++)
                 {
-                    sum += lower[i, j] * upper[j, k];
+                    sum += lower[i, j] / upper[j, k];
                 }
 
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:27:31
                     sum += lower[i, j] * upper[j, k];
                 }
 
-                upper[i, k] = source[i, k] - sum;
+                upper[i, k] = source[i, k] + sum;
             }
 
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:30:40
                 upper[i, k] = source[i, k] - sum;
             }
 
-            for (var k = i; k < pivot; k++)
+            for (var k = i; k < pivot; k--)
             {
                 if (i == k)
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource; Gpt5MiniUnitTests.LuTests.Eliminate_SingularMatrix_ReturnsNaNValues

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:30:29
                 upper[i, k] = source[i, k] - sum;
             }
 
-            for (var k = i; k < pivot; k++)
+            for (var k = i; k > pivot; k++)
             {
                 if (i == k)
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource; Gpt5MiniUnitTests.LuTests.Eliminate_1x1Matrix_ReturnsSolution

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:32:21
 
             for (var k = i; k < pivot; k++)
             {
-                if (i == k)
+                if (i != k)
                 {
                     lower[i, i] = 1;
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource

[Killed] Block removal mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:33:17
             for (var k = i; k < pivot; k++)
             {
                 if (i == k)
-                {
-                    lower[i, i] = 1;
-                }
+                {}
                 else
                 {
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource; Gpt5MiniUnitTests.LuTests.Eliminate_1x1Matrix_ReturnsSolution

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:42:25
 
                     for (var j = 0; j < i; j++)
                     {
-                        sum += lower[k, j] * upper[j, i];
+                        sum -= lower[k, j] * upper[j, i];
                     }
 
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource

[Survived] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:42:32
 
                     for (var j = 0; j < i; j++)
                     {
-                        sum += lower[k, j] * upper[j, i];
+                        sum += lower[k, j] / upper[j, i];
                     }
 

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:45:35
                         sum += lower[k, j] * upper[j, i];
                     }
 
-                    lower[k, i] = (source[k, i] - sum) / upper[i, i];
+                    lower[k, i] = (source[k, i] - sum) * upper[i, i];
                 }
             }
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:45:36
                         sum += lower[k, j] * upper[j, i];
                     }
 
-                    lower[k, i] = (source[k, i] - sum) / upper[i, i];
+                    lower[k, i] = (source[k, i] + sum) / upper[i, i];
                 }
             }
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Decompose_SquareMatrix_ReturnsLowerAndUpperWhichMultiplyToSource

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:55:13
 
     public double[] Eliminate(double[,] matrix, double[] coefficients)
     {
-        if (matrix.GetLength(0) != matrix.GetLength(1))
+        if (matrix.GetLength(0) == matrix.GetLength(1))
         {
             throw new ArgumentException("Matrix of equation coefficients is not square shaped.");
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Eliminate_SingularMatrix_ReturnsNaNValues; Gpt5MiniUnitTests.LuTests.Eliminate_1x1Matrix_ReturnsSolution

[Survived] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:57:13
     {
         if (matrix.GetLength(0) != matrix.GetLength(1))
         {
-            throw new ArgumentException("Matrix of equation coefficients is not square shaped.");
+            ;
         }
 

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:65:25
         var solution = new double[pivot]; // L * solution = upperTransform
         (double[,] l, double[,] u) = Decompose(matrix);
 
-        for (var i = 0; i < pivot; i++)
+        for (var i = 0; i <= pivot; i++)
         {
             double pivotPointSum = 0;
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Eliminate_SingularMatrix_ReturnsNaNValues; Gpt5MiniUnitTests.LuTests.Eliminate_1x1Matrix_ReturnsSolution

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:71:34
 
             for (var j = 0; j < i; j++)
             {
-                pivotPointSum += upperTransform[j, 0] * l[i, j];
+                pivotPointSum += upperTransform[j, 0] / l[i, j];
             }
 
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:71:17
 
             for (var j = 0; j < i; j++)
             {
-                pivotPointSum += upperTransform[j, 0] * l[i, j];
+                pivotPointSum -= upperTransform[j, 0] * l[i, j];
             }
 
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:74:37
                 pivotPointSum += upperTransform[j, 0] * l[i, j];
             }
 
-            upperTransform[i, 0] = (coefficients[i] - pivotPointSum) / l[i, i];
+            upperTransform[i, 0] = (coefficients[i] + pivotPointSum) / l[i, i];
         }
 
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution

[Survived] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:74:36
                 pivotPointSum += upperTransform[j, 0] * l[i, j];
             }
 
-            upperTransform[i, 0] = (coefficients[i] - pivotPointSum) / l[i, i];
+            upperTransform[i, 0] = (coefficients[i] - pivotPointSum) * l[i, i];
         }
 

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:77:22
             upperTransform[i, 0] = (coefficients[i] - pivotPointSum) / l[i, i];
         }
 
-        for (var i = pivot - 1; i >= 0; i--)
+        for (var i = pivot + 1; i >= 0; i--)
         {
             double pivotPointSum = 0;
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Eliminate_SingularMatrix_ReturnsNaNValues; Gpt5MiniUnitTests.LuTests.Eliminate_1x1Matrix_ReturnsSolution

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:77:33
             upperTransform[i, 0] = (coefficients[i] - pivotPointSum) / l[i, i];
         }
 
-        for (var i = pivot - 1; i >= 0; i--)
+        for (var i = pivot - 1; i < 0; i--)
         {
             double pivotPointSum = 0;
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Eliminate_SingularMatrix_ReturnsNaNValues; Gpt5MiniUnitTests.LuTests.Eliminate_1x1Matrix_ReturnsSolution

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:81:40
         {
             double pivotPointSum = 0;
 
-            for (var j = i; j < pivot; j++)
+            for (var j = i; j < pivot; j--)
             {
                 pivotPointSum += solution[j] * u[i, j];
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Eliminate_SingularMatrix_ReturnsNaNValues; Gpt5MiniUnitTests.LuTests.Eliminate_1x1Matrix_ReturnsSolution

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:81:29
         {
             double pivotPointSum = 0;
 
-            for (var j = i; j < pivot; j++)
+            for (var j = i; j <= pivot; j++)
             {
                 pivotPointSum += solution[j] * u[i, j];
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Eliminate_SingularMatrix_ReturnsNaNValues; Gpt5MiniUnitTests.LuTests.Eliminate_1x1Matrix_ReturnsSolution

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:83:17
 
             for (var j = i; j < pivot; j++)
             {
-                pivotPointSum += solution[j] * u[i, j];
+                pivotPointSum -= solution[j] * u[i, j];
             }
 
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:83:34
 
             for (var j = i; j < pivot; j++)
             {
-                pivotPointSum += solution[j] * u[i, j];
+                pivotPointSum += solution[j] / u[i, j];
             }
 
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:86:28
                 pivotPointSum += solution[j] * u[i, j];
             }
 
-            solution[i] = (upperTransform[i, 0] - pivotPointSum) / u[i, i];
+            solution[i] = (upperTransform[i, 0] + pivotPointSum) / u[i, i];
         }
 
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:86:27
                 pivotPointSum += solution[j] * u[i, j];
             }
 
-            solution[i] = (upperTransform[i, 0] - pivotPointSum) / u[i, i];
+            solution[i] = (upperTransform[i, 0] - pivotPointSum) * u[i, i];
         }
 
killedBy: Gpt5MiniUnitTests.LuTests.Eliminate_SolvesLinearSystem_ReturnsSolution; Gpt5MiniUnitTests.LuTests.Eliminate_1x1Matrix_ReturnsSolution
