[Survived] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:9:65
 {
     private static readonly string[] Words = new[] {
         "lorem", "ipsum", "dolor", "sit", "amet", "consectetuer",
-        "adipiscing", "elit", "sed", "diam", "nonummy", "nibh", "euismod",
+        "adipiscing", "elit", "sed", "diam", "nonummy", "nibh", "",
         "tincidunt", "ut", "laoreet", "dolore", "magna", "aliquam", "erat"};
 

[Survived] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:9:38
 {
     private static readonly string[] Words = new[] {
         "lorem", "ipsum", "dolor", "sit", "amet", "consectetuer",
-        "adipiscing", "elit", "sed", "diam", "nonummy", "nibh", "euismod",
+        "adipiscing", "elit", "sed", "", "nonummy", "nibh", "euismod",
         "tincidunt", "ut", "laoreet", "dolore", "magna", "aliquam", "erat"};
 

[Survived] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:10:49
     private static readonly string[] Words = new[] {
         "lorem", "ipsum", "dolor", "sit", "amet", "consectetuer",
         "adipiscing", "elit", "sed", "diam", "nonummy", "nibh", "euismod",
-        "tincidunt", "ut", "laoreet", "dolore", "magna", "aliquam", "erat"};
+        "tincidunt", "ut", "laoreet", "dolore", "", "aliquam", "erat"};
 
     private static readonly Random SharedRandom = new Random();

[Survived] String mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:10:69
     private static readonly string[] Words = new[] {
         "lorem", "ipsum", "dolor", "sit", "amet", "consectetuer",
         "adipiscing", "elit", "sed", "diam", "nonummy", "nibh", "euismod",
-        "tincidunt", "ut", "laoreet", "dolore", "magna", "aliquam", "erat"};
+        "tincidunt", "ut", "laoreet", "dolore", "magna", "aliquam", ""};
 
     private static readonly Random SharedRandom = new Random();

[Survived] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:21:28
         int maxSentences,
         int numParagraphs)
     {
-        var numSentences = SharedRandom.Next(maxSentences - minSentences) + minSentences + 1;
+        var numSentences = SharedRandom.Next(maxSentences - minSentences) + minSentences - 1;
         var numWords = SharedRandom.Next(maxWords - minWords) + minWords + 1;
         var result = new StringBuilder();

[Survived] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:21:28
         int maxSentences,
         int numParagraphs)
     {
-        var numSentences = SharedRandom.Next(maxSentences - minSentences) + minSentences + 1;
+        var numSentences = SharedRandom.Next(maxSentences - minSentences) - minSentences + 1;
         var numWords = SharedRandom.Next(maxWords - minWords) + minWords + 1;
         var result = new StringBuilder();

[Survived] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:22:42
         int numParagraphs)
     {
         var numSentences = SharedRandom.Next(maxSentences - minSentences) + minSentences + 1;
-        var numWords = SharedRandom.Next(maxWords - minWords) + minWords + 1;
+        var numWords = SharedRandom.Next(maxWords + minWords) + minWords + 1;
         var result = new StringBuilder();
 

[Survived] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:22:24
         int numParagraphs)
     {
         var numSentences = SharedRandom.Next(maxSentences - minSentences) + minSentences + 1;
-        var numWords = SharedRandom.Next(maxWords - minWords) + minWords + 1;
+        var numWords = SharedRandom.Next(maxWords - minWords) - minWords + 1;
         var result = new StringBuilder();
 

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:25:25
         var numWords = SharedRandom.Next(maxWords - minWords) + minWords + 1;
         var result = new StringBuilder();
 
-        for (var p = 0; p < numParagraphs; p++)
+        for (var p = 0; p <= numParagraphs; p++)
         {
             for (var s = 0; s < numSentences; s++)
killedBy: Gpt5MiniUnitTests.LoremIpsumGeneratorTests.GenerateLoremIpsumString_WhenNumParagraphsIsZero_ReturnsEmptyString

[Survived] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:25:44
         var numWords = SharedRandom.Next(maxWords - minWords) + minWords + 1;
         var result = new StringBuilder();
 
-        for (var p = 0; p < numParagraphs; p++)
+        for (var p = 0; p < numParagraphs; p--)
         {
             for (var s = 0; s < numSentences; s++)

[Survived] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:27:29
 
         for (var p = 0; p < numParagraphs; p++)
         {
-            for (var s = 0; s < numSentences; s++)
+            for (var s = 0; s > numSentences; s++)
             {
                 for (var w = 0; w < numWords; w++)

[Survived] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:27:29
 
         for (var p = 0; p < numParagraphs; p++)
         {
-            for (var s = 0; s < numSentences; s++)
+            for (var s = 0; s <= numSentences; s++)
             {
                 for (var w = 0; w < numWords; w++)

[Survived] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:29:33
         {
             for (var s = 0; s < numSentences; s++)
             {
-                for (var w = 0; w < numWords; w++)
+                for (var w = 0; w <= numWords; w++)
                 {
                     if (w > 0)

[Survived] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:29:47
         {
             for (var s = 0; s < numSentences; s++)
             {
-                for (var w = 0; w < numWords; w++)
+                for (var w = 0; w < numWords; w--)
                 {
                     if (w > 0)

[Survived] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:31:25
             {
                 for (var w = 0; w < numWords; w++)
                 {
-                    if (w > 0)
+                    if (!(w > 0))
                         result.Append(' ');
                     result.Append(Words[SharedRandom.Next(Words.Length)]);

[Survived] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:31:25
             {
                 for (var w = 0; w < numWords; w++)
                 {
-                    if (w > 0)
+                    if (w < 0)
                         result.Append(' ');
                     result.Append(Words[SharedRandom.Next(Words.Length)]);

[Survived] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:32:25
                 for (var w = 0; w < numWords; w++)
                 {
                     if (w > 0)
-                        result.Append(' ');
+                        ;
                     result.Append(Words[SharedRandom.Next(Words.Length)]);
                 }

[Survived] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:33:21
                 {
                     if (w > 0)
                         result.Append(' ');
-                    result.Append(Words[SharedRandom.Next(Words.Length)]);
+                    ;
                 }
                 result.Append(". ");

[Survived] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:35:17
                         result.Append(' ');
                     result.Append(Words[SharedRandom.Next(Words.Length)]);
                 }
-                result.Append(". ");
+                ;
             }
         }

[Killed] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:49:46
         int maxSentences,
         int numParagraphs)
     {
-        var numSentences = SharedRandom.Next(maxSentences - minSentences) + minSentences + 1;
+        var numSentences = SharedRandom.Next(maxSentences + minSentences) + minSentences + 1;
         var numWords = SharedRandom.Next(maxWords - minWords) + minWords + 1;
         var result = new StringBuilder();
killedBy: Gpt5MiniUnitTests.LoremIpsumGeneratorTests.GenerateLoremIpsumHtmlSafe_WithDeterministicBounds_ReturnsParagraphWrappersAndSentences

[Survived] Arithmetic mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:50:24
         int numParagraphs)
     {
         var numSentences = SharedRandom.Next(maxSentences - minSentences) + minSentences + 1;
-        var numWords = SharedRandom.Next(maxWords - minWords) + minWords + 1;
+        var numWords = SharedRandom.Next(maxWords - minWords) + minWords - 1;
         var result = new StringBuilder();
 

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:53:25
         var numWords = SharedRandom.Next(maxWords - minWords) + minWords + 1;
         var result = new StringBuilder();
 
-        for (var p = 0; p < numParagraphs; p++)
+        for (var p = 0; p > numParagraphs; p++)
         {
             result.Append("<p>");
killedBy: Gpt5MiniUnitTests.LoremIpsumGeneratorTests.GenerateLoremIpsumHtmlSafe_WithDeterministicBounds_ReturnsParagraphWrappersAndSentences

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:55:13
 
         for (var p = 0; p < numParagraphs; p++)
         {
-            result.Append("<p>");
+            ;
             for (var s = 0; s < numSentences; s++)
             {
killedBy: Gpt5MiniUnitTests.LoremIpsumGeneratorTests.GenerateLoremIpsumHtmlSafe_WithDeterministicBounds_ReturnsParagraphWrappersAndSentences

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:56:29
         for (var p = 0; p < numParagraphs; p++)
         {
             result.Append("<p>");
-            for (var s = 0; s < numSentences; s++)
+            for (var s = 0; s > numSentences; s++)
             {
                 for (var w = 0; w < numWords; w++)
killedBy: Gpt5MiniUnitTests.LoremIpsumGeneratorTests.GenerateLoremIpsumHtmlSafe_WithDeterministicBounds_ReturnsParagraphWrappersAndSentences

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:56:29
         for (var p = 0; p < numParagraphs; p++)
         {
             result.Append("<p>");
-            for (var s = 0; s < numSentences; s++)
+            for (var s = 0; s <= numSentences; s++)
             {
                 for (var w = 0; w < numWords; w++)
killedBy: Gpt5MiniUnitTests.LoremIpsumGeneratorTests.GenerateLoremIpsumHtmlSafe_WithDeterministicBounds_ReturnsParagraphWrappersAndSentences

[Survived] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:60:25
             {
                 for (var w = 0; w < numWords; w++)
                 {
-                    if (w > 0)
+                    if (w >= 0)
                         result.Append(' ');
                     result.Append(Words[SharedRandom.Next(Words.Length)]);

[Killed] Statement mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample9.cs:66:13
                 }
                 result.Append(". ");
             }
-            result.Append("</p>");
+            ;
         }
 
killedBy: Gpt5MiniUnitTests.LoremIpsumGeneratorTests.GenerateLoremIpsumHtmlSafe_WithDeterministicBounds_ReturnsParagraphWrappersAndSentences
