[Killed] Negate expression
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample10.cs:45:13
             throw new InvalidAuctionException("ERROR: Auction is over");
         }
 
-        if (auction.Bid >= bid)
+        if (!(auction.Bid >= bid))
         {
             throw new InvalidAuctionException("ERROR: Invalid bid");
killedBy: Qwen3Coder30BUnitTests.AuctionServiceTests.Bet_PassingLowerOrEqualBid_ThrowsInvalidAuctionException; Qwen3Coder30BUnitTests.AuctionServiceTests.Bet_ValidInputs_UpdatesAuctionAndCommits
