[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:37:29
             P[i] = P[row];
             P[row] = temp;
 
-            for (int j = 0; j < n; j++)
+            for (int j = 0; j <= n; j++)
             {
                 double tmp = matrix[i, j];
killedBy: Qwen3Coder30BUnitTests.LUPDecompositionTests.Decompose_ValidMatrix_OutputsPermutationArrayWithCorrectLength; Qwen3Coder30BUnitTests.LUPDecompositionTests.Decompose_ValidMatrix_OutputsLMatrixWithCorrectStructure; Qwen3Coder30BUnitTests.LUPDecompositionTests.Decompose_ValidMatrix_OutputsUMatrixWithCorrectStructure

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:44:36
                 matrix[row, j] = tmp;
             }
 
-            for (int j = i; j < n; j++)
+            for (int j = i; j < n; j--)
             {
                 double sum = 0;
killedBy: Qwen3Coder30BUnitTests.LUPDecompositionTests.Decompose_ValidMatrix_OutputsPermutationArrayWithCorrectLength; Qwen3Coder30BUnitTests.LUPDecompositionTests.Decompose_ValidMatrix_OutputsLMatrixWithCorrectStructure; Qwen3Coder30BUnitTests.LUPDecompositionTests.Decompose_ValidMatrix_OutputsUMatrixWithCorrectStructure

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample12.cs:53:33
                 U[i, j] = matrix[i, j] - sum;
             }
 
-            for (int j = i + 1; j < n; j++)
+            for (int j = i + 1; j <= n; j++)
             {
                 double sum = 0;
killedBy: Qwen3Coder30BUnitTests.LUPDecompositionTests.Decompose_ValidMatrix_OutputsPermutationArrayWithCorrectLength; Qwen3Coder30BUnitTests.LUPDecompositionTests.Decompose_ValidMatrix_OutputsLMatrixWithCorrectStructure; Qwen3Coder30BUnitTests.LUPDecompositionTests.Decompose_ValidMatrix_OutputsUMatrixWithCorrectStructure
