[Survived] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:27:25
         int dividedRows = (int)Math.Sqrt(arr.Length) / 2;
         int dividedColumns = (int)Math.Sqrt(arr.Length) / 2;
 
-        for (int i = 0; i < dividedRows; i++)
+        for (int i = 0; i <= dividedRows; i++)
         {
             for (int j = 0; j < dividedColumns; j++)

[Survived] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample14.cs:63:32
         int dividedColumns = (int)Math.Sqrt(arr.Length) / 2;
         int dividedRows = rows / 2;
 
-        for (int i = rows - 1; i > dividedRows; i--)
+        for (int i = rows - 1; i >= dividedRows; i--)
         {
             for (int j = 0; j < dividedColumns; j++)
