[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:5:48
 
 public static class StringExtensions
 {
-    public static bool IsDigit(this char c) => c >= '0' && c <= '9';
+    public static bool IsDigit(this char c) => c < '0' && c <= '9';
 
     public static bool IsInteger(this string s) => !string.IsNullOrWhiteSpace(s) && int.TryParse(s, out _);
killedBy: Qwen3Coder30BUnitTests.StringExtensionsTests.IsDigit_CharIsDigit_ReturnsTrue

[Killed] Conditional (false) mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample19.cs:50:16
 
         var pos = s.LastIndexOf('.');
 
-        return pos < 0
-            ? string.Empty
-            : s.Substring(pos + 1).Trim();
+        return (false?string.Empty
+:s.Substring(pos + 1).Trim());
     }
 }
killedBy: Qwen3Coder30BUnitTests.StringExtensionsTests.GetFileExtension_StringHasNoDot_ReturnsEmptyString
