[Killed] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:35:13
         int departmentId,
         int positionId)
     {
-        if (string.IsNullOrEmpty(name) && string.IsNullOrEmpty(country) && string.IsNullOrEmpty(city) &&
-            minSalary <= 0 && maxSalary <= 0 && departmentId <= 0 && positionId <= 0)
+        if (string.IsNullOrEmpty(name) && string.IsNullOrEmpty(country) && string.IsNullOrEmpty(city) &&
+            minSalary <= 0 && maxSalary <= 0 || departmentId <= 0 && positionId <= 0)
         {
             return await ListAsync();
killedBy: Qwen3Coder30BUnitTests.EmployeeServiceTests.ListFilteredAsync_WhenFiltersProvided_ReturnsFilteredEmployees

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:56:13
     {
         ValidateEmployee(employeeModel);
 
-        if (employeeModel.Id <= 0)
+        if (employeeModel.Id < 0)
         {
             throw new ArgumentException(nameof(employeeModel.Id));
killedBy: Qwen3Coder30BUnitTests.EmployeeServiceTests.UpdateAsync_WhenInvalidIdProvided_ThrowsArgumentException

[Killed] Logical mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:118:13
             }
         }
 
-        if (employeeModel.BirthDate <= new DateTime(1950, 1, 1) || employeeModel.BirthDate >= new DateTime(2010, 1, 1))
+        if (employeeModel.BirthDate <= new DateTime(1950, 1, 1) && employeeModel.BirthDate >= new DateTime(2010, 1, 1))
         {
             throw new ArgumentException(nameof(employeeModel.BirthDate));
killedBy: Qwen3Coder30BUnitTests.EmployeeServiceTests.AddAsync_WhenInvalidBirthDateProvided_ThrowsArgumentException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:186:13
             throw new ArgumentException(nameof(employeeModel.HireDate));
         }
 
-        if (employeeModel.Salary <= 0)
+        if (employeeModel.Salary < 0)
         {
             throw new ArgumentException(nameof(employeeModel.Salary));
killedBy: Qwen3Coder30BUnitTests.EmployeeServiceTests.AddAsync_WhenInvalidSalaryProvided_ThrowsArgumentException

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample2.cs:191:13
             throw new ArgumentException(nameof(employeeModel.Salary));
         }
 
-        if (employeeModel.DepartmentId <= 0)
+        if (employeeModel.DepartmentId < 0)
         {
             throw new ArgumentException(nameof(employeeModel.DepartmentId));
killedBy: Qwen3Coder30BUnitTests.EmployeeServiceTests.AddAsync_WhenInvalidDepartmentIdProvided_ThrowsArgumentException
