[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample20.cs:7:22
 {
     public void Shuffle(T[] array, int? seed = null)
     {
-        var random = seed is null
+        var random = seed is not null
             ? new Random()
             : new Random(seed.Value);
killedBy: Qwen3Coder30BUnitTests.FisherYatesShufflerTests.Shuffle_ArrayWithSeed_NullSeedUsesDefaultRandom; Qwen3Coder30BUnitTests.FisherYatesShufflerTests.Shuffle_ArrayHasOneElement_ArrayUnchanged; Qwen3Coder30BUnitTests.FisherYatesShufflerTests.Shuffle_ArrayIsEmpty_DoesNotThrow
