[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample5.cs:38:25
             throw new FolderNotFoundException($"Invalid Request. Folder `{folderNames[0]}` does not exist.");
         }
 
-        for (int i = 1; i < folderNames.Length; i++)
+        for (int i = 1; i > folderNames.Length; i++)
         {
             bool checksum = false;
killedBy: Qwen3Coder30BUnitTests.FolderServiceTests.GetFolderAsync_FolderDoesNotExistInsidePath_ThrowsFolderNotFoundException
