[Killed] PostIncrementExpression to PostDecrementExpression mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:18:40
 
         for (var i = 0; i < pivot; i++)
         {
-            for (var k = i; k < pivot; k++)
+            for (var k = i; k < pivot; k--)
             {
                 double sum = 0;
killedBy: Qwen3Coder30BUnitTests.LuTests.Decompose_SourceMatrixIsSquare_ReturnsLAndU

[Killed] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:30:29
                 upper[i, k] = source[i, k] - sum;
             }
 
-            for (var k = i; k < pivot; k++)
+            for (var k = i; k <= pivot; k++)
             {
                 if (i == k)
killedBy: Qwen3Coder30BUnitTests.LuTests.Decompose_SourceMatrixIsSquare_ReturnsLAndU

[Survived] Equality mutation
Projects/LlmUnitTestGenerationArtifacts/Dataset/Sample8.cs:40:37
                 {
                     double sum = 0;
 
-                    for (var j = 0; j < i; j++)
+                    for (var j = 0; j <= i; j++)
                     {
                         sum += lower[k, j] * upper[j, i];
